{"reviewText": "Perfect red tutu for the price. I baught it as part of my daughters Halloween costume and it looked great on her.", "overall": "+"}
{"reviewText": "This was a really cute tutu the only problem is that it was super short on my 5 yr old daughter. Other than that it was really adorable.", "overall": "+"}
{"reviewText": "the tutu color was very nice. the only issue with this tutu is the quality of material used. it appears cheap and after much play my 3 year old managed to snag a piece of the fabric and that was the end of life for this particular tutu.", "overall": "-"}
{"reviewText": "My 3-yr-old daughter received this as a gift for her birthday.  She's no pixy, but she's not huge either, and it was VERY tight on her, so I doubt a 6 year old can fit it comfortably.  The tutu fell apart after 12 hours -- the satin waistband detached from the tulle.  Unless twirling counts as rough wear, I'd say this was poorly constructed.  I sent two messages to Sydney So Sweet directly, trying to get a replacement or at least some kind of acknowledgement and NOTHING.  So ... crappy construction and crappy customer service.  I already don't like tutu/fairy/princess stuff, and this just furthers my opinion that companies like this are preying on daughters.  Boo!", "overall": "-"}
{"reviewText": "Bought it for my daughters first birthday which is lady bug themed and it fits perfect the stitching is a little loose but only need it one day", "overall": "+"}
{"reviewText": "I ordered this for a costume for me (I'm a 5'5\" adult) and was surprised by the quality considering it was under $10.  The tulle is double layered and the waistband is satin and very comfortable.  The waistband stretches to about 30\".", "overall": "+"}
{"reviewText": "This is a great tutu and at a really great price. It doesn't look cheap at all. I'm so glad I looked on Amazon and found such an affordable tutu that isn't made poorly. A++", "overall": "+"}
{"reviewText": "Got this for our youngest kid, she loves it. Its big and made better than the last cheap tutu we got for her.", "overall": "+"}
{"reviewText": "I bought this for my 4 yr old daughter for dance class, she wore it today for the first time and the teacher thought it was adorable. I bought this to go with a light blue long sleeve leotard and was happy the colors matched up great. Price was very good too since some of these go for over $15.00 dollars.", "overall": "+"}
{"reviewText": "Just as described and arrived fast-although I upgraded shipping options in hopes it would arrive in time for a school function (it did!)  Amazing price too!  This tutu is 3 layers- much better quality than I expected given the low cost!", "overall": "+"}
{"reviewText": "Purchased it for my daughter bc she needed a red tutu for her costume. It was really cute but it was not that puffy but it did the job.", "overall": "+"}
{"reviewText": "This really is a nice tutu for the price. It has multiple layers and is not cheaply made. For me the shipping was not very fast but it was very worth the money spent.", "overall": "+"}
{"reviewText": "Very cute, shorter than I was expecting, but then again, I didn't bother to calculate the measurements before ordering it. It has three layers of tulle, so it's not as full as the picture looks if stretched fully, but still a full skirt. I bought this skirt for my six year-old niece, so I highly doubt the skirt will ever be stretched to its full capacity on her. In fact, the skirt stretches pretty far but is also retractable so it can fit a variety of sizes.", "overall": "+"}
{"reviewText": "Vey cute and perfect for my 6 yr old daughter. She wore it to a princess birthday party. Lots of fun.", "overall": "+"}
{"reviewText": "Bought this for my 12 year old niece whom has the shape and figure of a twenty-something year old! It went under her Halloween costume and while I didn't think it was going to fit the circumference of her waist, it surprisingly DID! She wore it all night at her school dance and then again on a trick-or-treating outing and was comfortable the entire time! Thank you for making such a versatile product!", "overall": "+"}
{"reviewText": "Loved it and so did my daughter! Super cute and will stand up to many uses! She went as Ladybug Girl and looked the part with this tutu. :)", "overall": "+"}
{"reviewText": "I just got this today! I can't wait to see how it will look with my costume for halloween. I'm hoping it will be durable enough since I'm going down to Santa Barbara in this.I was a little iffy on getting this at first just because I read \"fit's kids ages 3-10\" but I'm 5\"1 114lbs and it sits perfectly on my waist. I was looking for a good length tutu that is reasonably short but short enough to please both my boyfriend and I and this tutu was perfect enough.Only downside is that the ends of the tutu look like it was cut with scissors and it makes me worried that for halloween it might come apart while I'm out with my friends. We'll see though, the tutu is still cute and completes my outfit (:", "overall": "+"}
{"reviewText": "Our 3-year-old petite granddaughter loves it!  I was afraid it might not be small enough, but it fit well with room for future growth!", "overall": "+"}
{"reviewText": "It was beautiful when I first received it. My 4yr old wore it once to her ballet class and it already started to come off the seams after one hour of use. I didn't bother returning it because my little one was about to throw a fit when I told her we were going to send it back. It was cheap anyway, ya get what you pay for. I just sewed it back together.", "overall": "-"}
{"reviewText": "The waistband was not sewed properly. I had to sew the front to the back myself so it would stay in place when it was worn.", "overall": "+"}
{"reviewText": "The tutu's was for my neice... She LOVED IT!!!  It fit well and will fit her for some time with the elastic waist.... great quality and very  inexpensive!  I would buy her another easily.", "overall": "+"}
{"reviewText": "My 5 year old daughter get this today for Christmas.  She and we are very pleased with it.  Thank you so much!", "overall": "+"}
{"reviewText": "This is a very basic tutu not a lot of layers like a \"full\" tutu but great for play or dress up.", "overall": "+"}
{"reviewText": "tutus are amazing. i love them and so does my sisters. my whole family weres them and use to wear them .", "overall": "+"}
{"reviewText": "I bought this as part of my halloween costume. It says it fits kids up to 10 years old. I'm 24 (size 1-3 in jeans depending on brand) but it fits perfectly. The only problem is it has a slightly odd odor. but i sprayed it down with perfume. lol so that took care of that problem! I Highly recommend this seller because they ship orders very fast.", "overall": "+"}
{"reviewText": "I bought this tutu as part of a costume for myself. I'm generally a size 8 or 10 in women's clothing. I took a risk getting this kids tutu but felt okay with the gamble considering other adult women's reviews. I cannot pull this UP over my hips but I can pull it on DOWN over my head and bring it to down to the right level. For a one time use at Halloween, it'll do! If you are an adult any bigger than me, I don't think you will be able to make this work for yourself. I will probably donate this to my niece's play clothes after the holiday is over as it is definitely kiddo size and she will still be able to get plenty of use out of it.", "overall": "+"}
{"reviewText": "Great product for the price.  There aren't many ballet classes available for my 4 year old so it doesn't get a lot of wear and tear but it's great for the times we need it.", "overall": "+"}
{"reviewText": "The tutu was the right color and fit my 3 1/2 year old granddaughter perfectly.  The price was right , too!", "overall": "+"}
{"reviewText": "These tutus fit my 5T/XS 5 year old and my 2T 2 year old very well, and look adorable! The quality seems good so far, too.", "overall": "+"}
{"reviewText": "This is a very cute tutu! The purple is so pretty!  Nicely made for a $7 tutu!  So glad I purchased it!", "overall": "+"}
{"reviewText": "I ordered this tutu for my 2 yr old granddaughter who loves tutus and expecially yellow ones. It is slightly big/long but she is able to wear it without a problem. She will be able to wear it for several years. So very adorable!! Well made, too.", "overall": "+"}
{"reviewText": "This tutu is very basic, but that's a good thing if you are ordering it for a costume, since it's easy to dress up and change into whatever you might need it to be. It was a great value, for the price the quality is very good. My daughter is 6, and a little chunky, but the elastic waist band fit her perfect (she is about a size 10 girls).", "overall": "+"}
{"reviewText": "Got this product thinking it was going to cheap and flimsy but it was just for my 2 year old to dress up went ahead and ordered it. I was blown away by how fast I got it (ordered it on a friday evening recieved it on monday morning) and the quality was wonderful. The color was a very nice purple and my little one loves it!", "overall": "+"}
{"reviewText": "It is a fine tutu, true to its price. My little ones liked it. Shipping is really fast. I would recommend it to others.", "overall": "+"}
{"reviewText": "excellent quality and a fast shipper.  i have a very active grand daug.,  and it has held up very well.  great buy.", "overall": "+"}
{"reviewText": "This tutu is exceptional.  I purchased several and my granddaughter loves every one of them and plays with them constantly.  Very pleased with this product and purchase.  The price is extremely reasonable.  Highly recommend this product.", "overall": "+"}
{"reviewText": "I was expecting a fuller tutu, but it still worked and looked pretty good.  Got here fast!  The color was perfect.", "overall": "+"}
{"reviewText": "Tutu is always a hit for young girls and my Grand daughter loves hers. Sometimes Momma can't get her out of it.", "overall": "+"}
{"reviewText": "Bought this for my 7yr old niece and she absolutely loved it. It was poofy, and great quality. Has an elastic waistband which is nice as I decided to try on myself when we played with barbies lol!!!", "overall": "+"}
{"reviewText": "Absolutely beautiful costume.  Very soft and breezy!  My granddaughter loves it!  Super fast delivery!  Thanks!  Wouldn't hesitate ordering more!  Runs true to size", "overall": "+"}
{"reviewText": "This was the skirt for my daughters halloween costume this year.  I have made lots of tutus, but this was so much easier and cheaper in the long run!  Also ordered orange!  A no-brainer.", "overall": "+"}
{"reviewText": "Cute tutus.  Definitely dress up play item.  Which is what we were looking for.  My little one loves to wear them around the house.  Good product for the price.", "overall": "+"}
{"reviewText": "I was slightly worried about it fitting, but the elastic in it works well. I am a 28 year old, wear anywhere from 5-9 size jeans (depending on the brand), and this tutu fit great. Wore it for a Costume Party Run Half Marathon (part of my Batman Costume) and it worked great. Wish it would have been a little fuller, but it did its job.", "overall": "+"}
{"reviewText": "My daughter and a friend were dressing up for Halloween as a 80's rock star.  This tutu worked perfectly.  It arrived very quickly and was just what we needed to finish off their outfits.", "overall": "+"}
{"reviewText": "What can I say... my daughters have it in orange, black, white and pink and I am thinking to buy for they the fuccia one. It is a very good way for exalt a dancer outfit: great colors, comfortable, looks great, easy to wear, durables and little girls love it. I think it is a great buy for costumer and play too.", "overall": "+"}
{"reviewText": "We bought several tutus at once, and they are got high reviews. Sturdy and seemingly well-made. The girls have been wearing them regularly, including out to play, and the tutus have stood up well. Fits the 3-yr old & the 5-yr old well. Clearly plenty of room to grow. Only con is that when the kids pull off the tutus, the waste band gets twisted, and an adult has to un-tangle. But this is not difficult.", "overall": "+"}
{"reviewText": "My daughter wore this for two hours on Halloween, after just the one use it was falling apart.  Poor quality, I would not recommend.", "overall": "-"}
{"reviewText": "It was exactly as described. Very happy with the product. .... .. .... ..... ..... .. ... .... .... ..", "overall": "+"}
{"reviewText": "I purchased these for my grandchildren ages 6 & 3 for Christmas & they love them. They are well made & the colors are beautiful.", "overall": "+"}
{"reviewText": "This tutu is really long on my 40&#34; daughter. It doesn't pouf out much either. It's more like a see through skirt. The two layers of touille get twisted every time she takes it off and I have to fight with it to figure out which is right side out again. Pretty cheap construction.", "overall": "-"}
{"reviewText": "my 8 year old daughter wore this 1 time for a couple hours for a school play and it fell right apart. she was upset and so was i.", "overall": "-"}
{"reviewText": "Thank you Halo Heaven great product for Little Girls.  My Great Grand Daughters Love these Tutu's.  Will buy more from this seller.  Made well and cute on the girls.  Thanks for a great product.NEVER BUY FROM DRESS UP DREAMS........I will buy more as long as I don't buy from &#34;Dress Up Dreams&#34;  I never rec'd or order in FL. Only rec'd pink, the purple one was missing.  Company is a rip off.  REFUSES to make good on purchase...... Real creeps.", "overall": "+"}
{"reviewText": "This is a good length, works for an adult, looks cute on and will be fun to wear. Great buy!", "overall": "+"}
{"reviewText": "I received this today and I'm not a fan of it but my daughter is I thought it would be puffier as it looks in the pic but it's not and the one they sent me is pink underneath and the waist band is pink which is not what I wanted due to the fact she already had the sandals she was gonna wear with it now I gotta find another pair of sandals,ima just keep it cuz she likes it.", "overall": "+"}
{"reviewText": "Bought this tutu for my 3.5yr old.  Fits her well around the waist, she's very happy.  Satin around the waist, other edges are unfinished.", "overall": "+"}
{"reviewText": "This tutu could be used for a kid...or a small adult--so it was perfect for me!  The waistband was decent quality and it worked great for my Halloween costume.", "overall": "+"}
{"reviewText": "This tutu lasted for a few months, but then the elastic lost it's elasticity....For the price it was worth it though.", "overall": "+"}
{"reviewText": "It is a little big for my 2 year old, but she wears a 3t.  She is a big girl for her age.  It is a little long but fits good around her waist.  She likes to dress herself and she is not \"easy\" doing so.  I was worried she would have it ripped but so far she has not.  It has really held up to her ruffness.  Wish I bought other colors and still just might", "overall": "+"}
{"reviewText": "I bought this for a race I was doing.  I was a little nervous buying a costume item that is marketed in child sizes.  I'm 27, 112 lbs, 5'3&#34;.  The tutu worked out perfectly and its expandable waistband could easily have stretched even further.  I also cut it to make it a little shorter.  Overall, great buy for the price.", "overall": "+"}
{"reviewText": "Highly recommended for basic little girls tutu. Great for kids who are still growing and might need a size change later on.", "overall": "+"}
{"reviewText": "I looked all over amazon for a tutu, I wanted a nice full one. After much debate I decided to take my chances on this one, the price is great which also did actually worry me. I received it yesterday and it FAR exceeds my expectations, it's beautiful, LOVE IT. It's very full with 3 layers of tulle and a nice satin finished waistband. My daughter is 1 and has a tiny waist, I thought I would have to take it in when I got it but amazingly it fits her and she has PLENTY of room to grow in it as well. It is pretty long on her right now like a full length tutu but that makes it even prettier on her at this point. As she grows obviously it will become shorter, I can't believe I paid this price for such a cute tutu that she can have and grow into for a few years to come, fantastic. I didn't even have to iron it, it was packaged straight no crinkles.", "overall": "+"}
{"reviewText": "what was sent to me is a royal blue tutu - not turquoise, turquoise has a touch of green to it.", "overall": "-"}
{"reviewText": "This was a one-size-fits-all toddlers skirt. My toddler niece is swimming in it. I don't mind because toddlers grow fast so I'm sure she'll be wearing it within a year or so. She loves tutus, so she'll wear it before then as well...it'll just be a large skirt...like a dress.", "overall": "+"}
{"reviewText": "I sent it to my granddaughter for her 4th birthday and she LOVED it!  Wore it around the house over her long pants.", "overall": "+"}
{"reviewText": "Very nice for the price! Washed by hand and held up nicely. The quality is nice and my daugher loves it!", "overall": "+"}
{"reviewText": "These were a good buy - great color and quality for the price. Bought them for a ballet themed party and girls loved them!", "overall": "+"}
{"reviewText": "My daughter wore this at her first dance recital.  I wasn't expecting much since it was so cheap.  It is suprizingly soft, and the length was great.  She stood out from other girls that had homeade tutu's and I can't imagine that one could be made for cheaper than the $7 I paid for it.", "overall": "+"}
{"reviewText": "Bought this as a backup to the regular ballet outfit my daughter has to wear. So far, she's using it to play out her Cinderella dreams but I am sure we'll be able to use it for a recital sometime soon. The quality is just fine for the price we paid. I was not expecting a designer skirt for this price and got exactly what I paid for.", "overall": "+"}
{"reviewText": "I wanted it for a one time use, and after that i kept it for playing. Very nice looking on the first use, you could see it staring to wear after the first use. If fit my 2y old just fine, and my 6y old too.", "overall": "+"}
{"reviewText": "my daughter loves it, we bought for her ballet classes and it's perfect i would recomend to anyone looking for one", "overall": "+"}
{"reviewText": "It is nice and full and the construction of the tutu is well done .  The other reviews of this item were right on - 5 stars.", "overall": "+"}
{"reviewText": "Another example of &#34;you get what you pay for.&#34;  Just know that it does not stand out as pictured, there is no ballet tutu stiffness to it, but if you want a purple soft tulle skirt skirt with cheap elastic waist, it works. Same texture as chiffon.", "overall": "-"}
{"reviewText": "Our granddaughter immedicately put her tutu on when it came in the mail. She loved it! She even wore it over her clothes to chuch that following Sunday. It was great to see to see her so happy. However, after I bought it, I found out Walmart was selling them for only $5 and I wouldn't have had to pay shipping and Handling. The look on my granddaughter's face was well worth the extra money.", "overall": "+"}
{"reviewText": "I bought this for my granddaughter as part of her Halloween costume.  Now she never takes it off.  She loves it.", "overall": "+"}
{"reviewText": "This is perfect my niece love it.  It fit perfect she is 4years olds not to big just right.I love that it has a lining, i purchase one from another store but I had to get legging for her to wear under the tutu.I will purchase another one or two.", "overall": "+"}
{"reviewText": "My toddler love this so much. It has held well. She wears this several times a week. We have three colors of this from the same seller.", "overall": "+"}
{"reviewText": "Love the &#34;feel&#34;....the length is great on a 7 year old.....the waistline fits (that never happens because they always need to have tucks taken)...the look is fabulous and the price is even better!!!", "overall": "+"}
{"reviewText": "They fell apart the first day that they wore them...I literally had to throw them away....disapointed....still waiting for replacements.....poorly made....", "overall": "-"}
{"reviewText": "Our granddaughter is so into dress-up and this, with the Lady bug wing set, was a great alternative to princesses!", "overall": "+"}
{"reviewText": "Got this for my 2 year old daughter and I expected it to be very thin and flimsy considering the price. I was totally wrong. The skirt is very full and has many layers. Very happy with the purchase and she looks adorable in it!", "overall": "+"}
{"reviewText": "This tutu fell apart literally minutes after my niece put it on. I wasn't impressed with the quality, though I suppose for the price I shouldn't have been surprised.", "overall": "-"}
{"reviewText": "Great price! This cute little tutu has held up through multiple wearings by a three-year old. We even bought two more!", "overall": "+"}
{"reviewText": "My granddaughter loved it. She is only 4 years old and loves being a little ballerina. She is my little ballerina!", "overall": "+"}
{"reviewText": "I bought this for my daughters cinderella party. I am pleasantly surprised with the fullness and the price cannot be beat!", "overall": "+"}
{"reviewText": "This skirt is SUPER cute.  My only problem w it was it had a strong odor upon arrival. I have to assume its in the dye but unfortunately it smells just like urine.  Once I sprayed it with Febreeze and let it air out, the smell is not so strong.  Other than that it is good quality and well worth the money.", "overall": "+"}
{"reviewText": "they were great and loved the red satin around the waist.  I would have had to make them for the recital and didn't really have time.  The cost was reasonable as well.", "overall": "+"}
{"reviewText": "The tutu looks just like the picture, no surprises. The nylon net is good quality and the elastic waist fit my tiny waisted grand daughter.", "overall": "+"}
{"reviewText": "I wanted well-made dress-up items for my granddaughter and this is great!  I chose pink but there are many colors available.", "overall": "+"}
{"reviewText": "Said they would fit a certain size but when we got them they are a lot smaller then as described.", "overall": "-"}
{"reviewText": "My daughter's first request out of bed in the morning is \"I want tutu!!\" So I knew I needed to find some durable options fast. This is one of three I purchased. The quality is ... What you should expect from tulle. It frays easily on the bottom. For occasional dress up this is perfect. For an everyday tutu uniform, it's going to fall short. I think I'll try to add this as a subscribe and save item.", "overall": "+"}
{"reviewText": "Twice we've had to repair it. It rips along the ribbon-the tulle pulls away. My mom reinforced it but it still ripped.", "overall": "+"}
{"reviewText": "A beautiful yellow, not too bright. It has three layers which makes for a nicely shaped tutu. Good for up to 10 years old.", "overall": "+"}
{"reviewText": "My granddaughter was thrilled when her ballet teacher said she could wear any color tutu she wanted.  All of her classmates have pink.  My granddaughter dances to her own beat.  She is almost 6 years old and to have a green tutu that is the perfect green is wonderful.", "overall": "+"}
{"reviewText": "My two-year-old wears it everywhere.  Perfect choice for a little girly girl!  Now she can dress up like her big sister.", "overall": "+"}
{"reviewText": "my little 3 year old and 1 year old love dressing up in these!!!  very well made and very poofy!!!", "overall": "+"}
{"reviewText": "Both tutus were mailed in a flat plastic bag in a manila envelope.  Needless to say, they arrived perfectly flat, not at all like the fluffy tutu shown in the photo.  I had to purchase 6 yards of red netting, cut into strips, gather it, and sew it onto the flattened netting of both tutus.  I have purchased tutu's from other sources that shipped them in 12x12 boxes so that when they arrived, they were, indeed, the fluffy tutu I had ordered.", "overall": "-"}
{"reviewText": "put it in the washer bc like a normal kid my daughter got it dirty. When i took it out it was all ripped up at the ends. she was so uppset when i got rid of it for the price i paid I thought it would be a little better.", "overall": "-"}
{"reviewText": "Very cute however poorly made. This tutu didnt last a full day before it was coming apart at the seams.  Which is really too bad because my 6 yr old was really excited about wearing it again.", "overall": "-"}
{"reviewText": "This is an average tutu.  It fits my 3 year old fine and is cute, but it is sort of stiff and smells very chemically.  I have yet to wash it, so maybe after I do it will soften and lose the smell.  *Followup- I have washed it and it is better, not so smelly and stiff.  I changed my rating to 4 stars.", "overall": "+"}
{"reviewText": "Great tutu for a great price. It isn't a &#34;full&#34; or high quality skirt, but it is perfect for my daughter to wear over leggings for her little outfits.", "overall": "+"}
{"reviewText": "The tutu was exactly as pictured in the photo and arrived a few days earlier then I expected it to arrive.", "overall": "+"}
{"reviewText": "My granddaughter wanted this as a surprise for her mother for Christmas..  She actually wanted it to dress up a large bear she had.  It was well made and for the price, you could not beat it.", "overall": "+"}
{"reviewText": "My daughter liked this, and it with her costume, but she would have liked it to be a bit fuller.", "overall": "+"}
{"reviewText": "For what I paid for two tutus is unbeatable anywhere!  I ordered a pink and turquios and they are vibrant and beautiful! The tutu is very full! Princess style! Not cheaply made! Not cheap materia! Obviously someone made these with love and care! I paid less than 7 bucks for a tutu I and I feel proud of my self for researching to the point of finding gold!Recommend 2-6 years!My daughter is two ! Wears size 4t and this skirt ( one size ) fit perfect and will probaly be able to accommodate her quickly growing waist for some time!", "overall": "+"}
{"reviewText": "Bought this tutu for a tutu and heels bachelorette party. It says its for kids but worked out great.I weigh 135lb and 5'8&#34;. I wore legging underneath or would have been exposed.Great thing is my 2 year old daughter can use it and loves it!]Material is not bad but don't expect it to last long. Worth it for the price.", "overall": "+"}
{"reviewText": "Got this for my niece and she loved it!  There is a silk lining so that it doesn't scratch the legs which is a big plus! Shipped fast too.", "overall": "+"}
{"reviewText": "I used this to complete my ballerina Thor costume and it worked PERFECTLY! I still have it and it's in great condition. A little staticky but that's to be expected. I bought shorts to go underneath, so it was great.", "overall": "+"}
{"reviewText": "I got this for my sister she is in love with I'm very happy with the shape color everything !! Really great product I love it !!!! Fantastic !", "overall": "+"}
{"reviewText": "The shipping is crazy on these if you're buying more than one of these, but the tutus are really well made. I glued snowflakes to them as party favors for a Frozen birthday party and the girls loved them!", "overall": "+"}
{"reviewText": "Pretty good quality tutu for a great price.  My daughter loves this for her tot ballet class.  It even seems to hold up ok to washing machine as long as I wash on delicate, which many of her other tutus have not turned out as well.", "overall": "+"}
{"reviewText": "Perfect for my 3 year old daughter! Bought it for her bday party, but it came a day later, but not their fault! She likes to wear it with tshirts and crocs and wears it over spandex shorts! It's definitely puffy enough!", "overall": "+"}
{"reviewText": "Wonder my niece wears it every single day, yellow is her favorite color right now an this cute little tutu made he da. It is well built and we hope she gets lots of wear out of it.", "overall": "+"}
{"reviewText": "My daughter wore this every other day for maybe half an hour at most.  The waistband has completely separated from the elastic after two weeks of this light use.", "overall": "-"}
{"reviewText": "It gets stars because it's gorgeous (very full, a nice rich purple) and is soft.  But maybe a play tutu ought to be made out of slightly more substantial material and sewn with stronger thread.  My daughter was just dancing around (not pulling at it) and it got a big hole in it at the top seam.  I'll fix it, but I bought it precisely so I wouldn't have to sew one!", "overall": "-"}
{"reviewText": "I used it for my 8 MONTH old. I wanted it a little shorter so I cut about 2 inches off. I think she would be able to wear it for a long time because the waist band is stretchy and it was a little loose.", "overall": "+"}
{"reviewText": "For the money, I got exactly what I paid for.  It is perfect for my 4 year old daughter.  She loves it.", "overall": "+"}
{"reviewText": "Really cute skirt. Very good quality for a ballet style skirt. I am required to write 4 more words, now just one.", "overall": "+"}
{"reviewText": "We really like my daughters tutu. It's simple, but elegant! I would like more colors!  I would buy another for sure", "overall": "+"}
{"reviewText": "My granddaughter loves to wear this.  The waist band is soft and comfortable.  Have not had to wash it yet, so don't know how it will launder.", "overall": "+"}
{"reviewText": "I bought this for my four year old niece with some fairy wings.  She loved it and would not take it off until bedtime.  It is nice fabric and fit her perfectly!", "overall": "+"}
{"reviewText": "I bought this tutu for my granddaughter. She loves wearing tutus and I liked the variety of colors available. The price is reasonable and if it gets damaged I'm happy knowing she had joy hours of enjoyment!", "overall": "+"}
{"reviewText": "My daughter has worn this skirt almost every day since she received it and it's even been through the washer along with the other clothes.  It's amazing quality!  She fits a 4T and it's just above her knee, and has a little bit of growing room, although I'm not so sure as much as others are saying.  But considering how often she wears it, I'm not worried! ;)", "overall": "+"}
{"reviewText": "I ordered this purple tutu for my daughter's first birthday. It was so fun and cute! It was obviously a little big on her because she was only a year old, but the elastic worked well enough and she will be able to wear it for many more birthdays to come. It came to her feet like a dress but didn't drag or trip her at all. I was able to wash it on a regular cycle (I just put it in a lingerie bag to be safe) and tumbled it on low. Great & fun item!", "overall": "+"}
{"reviewText": "I bought this Tutu for my 7 year old daughters Diva party. She loved it and it looked sooo cute on!It is not flimsy at all a great value for the price. I would buy more in different colors!", "overall": "+"}
{"reviewText": "We originally bought this for my daughter's Halloween costume and it was as bright, cute and fluffy as it looks in the picture. (Once you fluff if out of the package.) It's been a constant favorite of my daughter ever since.  She's worn it for parties and play time.  It's been stuffed in toy-boxes and left on floor and it is still holding up perfectly.  The waistband is stretchy enough to fit a larger child but still stays snug on a 4 yr old (now 5). Great value for the price.", "overall": "+"}
{"reviewText": "Tutus were great for holiday dance show and what we needed them for. They were shipped very quickly and came very neat, no need to steam them. Fits younger girls and small waisted teens.", "overall": "+"}
{"reviewText": "My granddaughter wears a tutu just about every day.  I like this one because it's shaped just right and is PLAIN.  Some of the ones I see in the stores are hideous, so gaudy.  heh, although she wears them just as proudly. I sent this one to her for her birthday and saw her on skype dancing and twirling.  Mission accomplished.", "overall": "+"}
{"reviewText": "great tutu for my daughter to play dress up in. she loves this and will stay in it most of the day haha. it is not too tight and not too short great for playing and twirling.", "overall": "+"}
{"reviewText": "We bought this for our two and a half year old daughter for Valentines Day. Its a lot thinner then I thought, but very cute. No cleaning instructions.", "overall": "+"}
{"reviewText": "I bought this for my 7 year old daughter. It's a nice red tutu but it's not what I wanted. It was a little too short for my taste and I'm not sure if I like the way it fits her. I haven't decided if I wanna use it or not. :-(", "overall": "+"}
{"reviewText": "Item was exactly what I was looking for.  Girls loved their Christmas gift !. . .  would buy again from this vendor.", "overall": "+"}
{"reviewText": "Absolutely love this tutu. Fit my little girl perfectly (she's a size 4t) Arrived super quick - just in time for a Halloween party & just in time to replace a &#34;no-show&#34; costume. It ended being a huge hit & I actually ended up liking it even more than my original purchase.", "overall": "+"}
{"reviewText": "I was pleasantly suprised when the package arrived - high quality craftsmanship, enough layers of tuling to really fluff and keep what is underneath covered.  The price was a steal - I will definately purchase this line in the future for gifts.", "overall": "+"}
{"reviewText": "I got this for my daughter who is now 2 years and 4 months old. Her weight is in the lower 25th percentile, but she is tall for her age. This tutu fit her well on the waist, and the length came to her knees, which was perfect. The color is very pretty and the waist band is sewed well. My daughter specifically wanted a blue tutu, and this was the best deal I found in the small size and Prime eligible.", "overall": "+"}
{"reviewText": "We bought this for our 2 year old and she LOVES the color. The tutu is very full on her and she loves how it flies when she twirls. It has a bright satin band with the elastic underneath, which helps the elastic not annoy her sensitive skin.Our daughter is very small so I was afraid it might be to big, but it stays up and isn't to long on her!", "overall": "+"}
{"reviewText": "This was a good purchase, seems to be well made and also fuller than I had anticipated - good gift to add to alreadypurchased  Christmas gifts for grand daughter :)", "overall": "+"}
{"reviewText": "I bought a white tutu. My 4 year old daughter loves it. It looks very beautiful and graceful on her.", "overall": "+"}
{"reviewText": "I was very impressed with the tutus. Very good quality. Excellent price! .....and the girls absolutely loved them! They looked fabulous!", "overall": "+"}
{"reviewText": "Purchased this tutu for my granddaughter's first birthday.  It fit nicely with room to grow in.  I'm very please with it and will purchase more in varying colors in the future.", "overall": "+"}
{"reviewText": "Bought this for my 3 1/2 yo daughter for Christmas for dress up. She loves it! Good quality. Very poofy, frilly and girly!", "overall": "+"}
{"reviewText": "I was impressed when I first opened the package.  Very cute!  However, either it is not well made or my toddler is extra hard on it because it has unraveled in a short amount of time.  I would not buy this again.", "overall": "-"}
{"reviewText": "I just bought this for a halloween costume and it got to my house within 4 days!! I was very happy about that! I took a star down because it is a LITTLE bit see through but not very much. It very good for ages 5-12", "overall": "+"}
{"reviewText": "while i understand i should pay more attention to product description. i was in a hurry online shopping and searched multiple tutus for 2 year old. I saw this picture and assumed it came with all of them. and when i received one i had to go back and read that it was only the lavender. mostly my fault but maybe product pic should only show the one color you are choosing..", "overall": "+"}
{"reviewText": "I got this tutu for for halloween for my baby girl and she loved it. It arrived fast and in perfect condition!", "overall": "+"}
{"reviewText": "Tutu fits a little tight and the quality is not the best. Beautiful color though. I would not purchase again.", "overall": "-"}
{"reviewText": "Received the red tutu late, I needed it to accessorize a Halloween costume.  My 6yr.old loved it though, she wore it immediately and wouldn't take it off.  She wore it with a pair of leggings and a leopard tank top.  It is really cute.", "overall": "+"}
{"reviewText": "I got this in pink and white for a slender 2 year old. It is a little on the loose side, but it does stay on. While my little girl is a bit of a tomboy, as she is overshadowed by 5 older brothers, she does enjoy wearing this over her jeggings and running around and playing. Her playdates, two who are closer to 3, are madly in love with the tutus--it's a good thing we only have one of them at a time. I think that it would ideally fit a 3 or 4 year old without any stretch, but could fit kids possibly up to the age of twelve with the amount of stretch it has. The elastic has very nice give and the layers of tulle are very nicely proportioned and soft. After throwing it in the wash, the edges can curl a little with minimal fray--maybe I could have put it on a gentler cycle, but it looks pretty much lithe same. I really like the way the elastic is sewn in. The satin edge is part of the tulle fabric, not sewn on, and the elastic is enclosed between the layers of the satin edge, making it seem pretty secure. I have made my own tutus, but they never looked as nice or were so soft.", "overall": "+"}
{"reviewText": "good price and just what I wanted. My granddaughters have thoroughly enjoyed them. They play with them nearly every day.", "overall": "+"}
{"reviewText": "Delievered quickly.  Really cute and better quality than I expected considering the reasonable price.  I would recommend this tutu to others.", "overall": "+"}
{"reviewText": "Pefect!! My 4 year old boy loves wearing it. We bought it for a parade where we were all going to be water fairies and he alternates between that and being the best butterfly ever!! Color is gorgeous, cleans up well after food spills and waistband seems very hearty! Can also double as a fun headcovering for adults.", "overall": "+"}
{"reviewText": "Full and well stitched.  This tutu is a beautiful purple color that looks just like the picture.  It looks just adorable on our little fairy.", "overall": "+"}
{"reviewText": "I bought this for a 4-5 year old for Christmas for dressing up. It was a big hit. She loved it", "overall": "+"}
{"reviewText": "It fits my daughter great and serves it's purpose wonderfully! She wears it all the time! I would recommend this skirt.", "overall": "+"}
{"reviewText": "This was a gift for a two year old and a five year old.  The girls squealed upon opening the box, they grabbed the tutus, put them on, and wore them the rest of the day.  The tutus seem to be well made, and can stand up to handling by little princesses.  I recommend these tutus.", "overall": "+"}
{"reviewText": "I bought this for my baby cousin and she never had a tutu before this was a great first tutu and fit perfect according to the size we got.", "overall": "+"}
{"reviewText": "This was perfect for my son's 4 year old friend for her birthday.  Perfect for dress up or to wear over shorts or pants.  Price point was perfect too!", "overall": "+"}
{"reviewText": "Great tutu for the price.  Not as fluffy as I would have thought.  It is a beautiful purple color, though.", "overall": "+"}
{"reviewText": "So cute and fluffier than i expected. Wish it came in my size. The waist band is a little weird so i gave it 4 stars. It doesnt lay flat.", "overall": "+"}
{"reviewText": "Love the tutu fast shipping looks like a well made Tutu and you can't bet the price. My little girl loved it.", "overall": "+"}
{"reviewText": "Really great price for easy dress up play.  The colors are fun and vibrant.  Easy on and off. What more does one want in a tu-tu?", "overall": "+"}
{"reviewText": "I would buy this again for the price, but I didn't like how the waist wasn't stitched down like a waistband...the top of the tulle is covered well, but I thought it would have a flat waistband.", "overall": "+"}
{"reviewText": "We bought this tutu as part of my daughter's halloween costume.  Love that she can now use it to dress up and to wear to her dance class.  The best feature of this tutu is the layers...not so flimsy that you can see through it.  Like that it keeps my daughter a little more covered up!", "overall": "+"}
{"reviewText": "My 3yr old loved this tutu skirt in pink! Was hoping to order more in different colors.She had hardly used this,the stitching came apart in 2weeks.now it's lying in her closet..Altogether she wore it like 4-5 times for 20 mins or so.wish the stitching was of better quality to hold up while little ones wear it. Can't recommend.", "overall": "+"}
{"reviewText": "Perfect for my budding grand daughter ballerina! Beautiful vibrant color.  Fits great and easy to  clean!  I bought several more colors!", "overall": "+"}
{"reviewText": "I ordered these tutus for my boyfriends daughter, she loves them! I was scared they would not be very full because when they arrived they were packaged very small. But as soon as I opened the plastic they filled out beautifully. Since most toddler tutus are around $40, I was very pleased I got these under $10. Great for playing dress up!", "overall": "+"}
{"reviewText": "My neice loved it. She is a dress-up kind of girl and loved adding the tutu to her collection. Was upset that it didn't specify only one tutu is sold at a time unless you specify quantity...I thought it came as a set.", "overall": "+"}
{"reviewText": "After only wearing the skirt once by my daughter, the stitching at the waist has already come undone.  I would return the product but the shipping would cost more than the skirt.", "overall": "-"}
{"reviewText": "This was a costume for an adult at an elementary school.  The kids loved it, it fit great for an adult, and seems very sturdy for future uses.", "overall": "+"}
{"reviewText": "Never GOT this item - but gave a 1 STAR because the replies from the SUPPLIER was GREAT.They tried to send the item more than once.My $ was refunded in a timely manner too.It was a shame I never got it for my daughter - it would of looked great with her OUTFIT for Dr. Seuss WEEK at school.Most original.Maybe next time.", "overall": "-"}
{"reviewText": "Perfect!!Teal tutu for 2nd birthday outfit! Loved it! Thought the color matched perfectly with her &#34;I am 2&#34; t-shirt and her leggings!", "overall": "+"}
{"reviewText": "I ordered 26 tutus for a school production.  After 19 days and 4 e-mails (only 1 answered) I finally recieved them.  This company is a joke.  I spoke with a representative from the company before making the purchase and she was going to refund some costs because I ordered a large quantity.  Of course that never happened. After 2 weeks and the tracking of the package never changing, I began to attempt to contact.  After 2 unanswered e-mails, she responded,&#34; I thought these were for a Christmas play?  You still have time.&#34;  What??? That is not the point.  I needed them for  a meeting to discuss the costumes.  She then said the package had been lost- really??? She never shipped them.  When I did receive the package the skirts were stuffed in a paper towel box with out even an invoice, piece of plastic around them or anything. Skirts were fine.  The company is lacking in every way.", "overall": "+"}
{"reviewText": "Nice and puffy tutu skirt. I would recommend this for girls under 10 yr. old.  It will be too short and small for older girls.", "overall": "+"}
{"reviewText": "Absolutely darling! Only issue is that it is a different blue than the picture. But that is not a problem.", "overall": "+"}
{"reviewText": "This is great for use as a dance costume, for play, or even as part of a party outfit. It fits my daughter who wears 3t now and has plenty of room to stretch, so she will probably be able to wear it for a few years.  If worn in public a leotard, thick tights or leggings will be needed.", "overall": "+"}
{"reviewText": "Perfect party favor my my daughters tutu cute party! I ordered 4 purple turus for each of her friends to wear ranging in age 1 1/2-6 and they all loved them!", "overall": "+"}
{"reviewText": "im 18 with a 32 inch waist it was great.It was a little tight but i didnt mind and the price was great and it was worth to be used", "overall": "+"}
{"reviewText": "This is exactly what I needed to make my 8 year old daughter's Halloween costume more full in appearance.  It arrived quickly and fit her well.", "overall": "+"}
{"reviewText": "This was a gift for my 2 year old niece. The waist fit just right and the elastic will let her wear it for quite a long time. I was afraid it would be long and saggy on her because she's so small, but I was happy to see the length was perfect and it was quite fluffy. Will be looking to buy more in other colors!", "overall": "+"}
{"reviewText": "We got this for my daughter for Christmas, she has only worn it a few times this week, its only new years now and it is completely unraveling! The material is so cheap, I can't even sew it back on, it would just unravel again, I had to completely remake it! Not worth it, very disappointed!", "overall": "-"}
{"reviewText": "greatgrand daughters love them, put them on the minute they got them. I was really happy they loved them all", "overall": "+"}
{"reviewText": "When i was purchasing this item i was under the impression that i was going to recieve all colors of the tutus but when i just recieved my package i only recieved 1!!!!! there was no where i could pick my color so thats why i figured it came with all the colors. the picture is false advertisment showing all colors and then when you get your package you only get one!!", "overall": "-"}
{"reviewText": "this is a great tutu for a smaller child! nicely made, great buy for 7 bucks! i am happy with my purchase", "overall": "+"}
{"reviewText": "The item was perfect for my 3 year old granddaughter who is taking her first ballet class.  Materials were good and the item came quickly.  Great price.", "overall": "+"}
{"reviewText": "Unfortunately this skirts elastic is not stretchy enough to accommodate the 2-9 yr old range., This is CRAZY!!  I would say it only stretches through about 1 size..  I would throw this in a costume play chest (with a safety pin handy) and call it a day", "overall": "-"}
{"reviewText": "Great price, and it came within a reasonable amount of time. If I ever need any additional Tutu's I would buy them from this company.", "overall": "+"}
{"reviewText": "I was right....girls still like to dress up in net skirts. I bought my granddaughter three of these tutus and she has one on just about every day. She is not quite three and has a tiny waist, and skirt fits her fine, so I don't know if it would work for anyone over about 4-5 years. It's fairly well made...not great but pretty good. The waistband may give out eventually...as it gets very twisted every time she takes it off. But it's a great value, because she plays with it more than most of her other toys.", "overall": "+"}
{"reviewText": "Was really cute when I received it. Washed it on a gentle cycle because my grand daughter has severe allergies and the entire thing came apart. Needed it for a school production and had to handstich the waistband back together. Would not buy again.", "overall": "-"}
{"reviewText": "I'm a 21yo male. Waist 30-31, 150lbs and it fits me just fine. Just a little tight getting it around my thighs but it fits just fine. Bought it for a Halloween costume. Very pleased. Order oct 17th. Shipped oct 22nd. Delivered oct 25th", "overall": "+"}
{"reviewText": "Love it and my daughter loves it--perfect for dress up or even to wear out. It's affordable and a hit!", "overall": "+"}
{"reviewText": "Really cute tutu at a bargain price! My 12yr old daughter used it for a Minnie mouse costume. We were really happy with the purchase and only reason for not giving it 5 stars is that it arrived a couple days later than promised date.", "overall": "+"}
{"reviewText": "Bought this for my niece as part of her fairy outfit.  She loves it and wears it all the time.  Well made for the price.", "overall": "+"}
{"reviewText": "I'm really happy with the quality of this tutu, the satin waistband was a lovely touch, and I was happily surprised at the many layers of tulle, this is not a cheaply made tutu! This is a perfect present for my niece, thanks!", "overall": "+"}
{"reviewText": "We purchased a black tutu.  My 5 year old and 2 year old can both where it!  They love how 'fancy' it is and I love how cute it is!", "overall": "+"}
{"reviewText": "This is such a cute skirt.  It seems flimsy and small when you take it out of the package, but once my five-year-old put it on, I could see that it was perfect.  It's just what it looks like and will likely fit smaller and larger than her 5T size.", "overall": "+"}
{"reviewText": "I bought this for my 2 year old niece for Christmas. My sister-in-law told me that she wears it every night before she goes to bed. She is really into the color pink right now, the fuchsia tutu was a big hit for her.", "overall": "+"}
{"reviewText": "Bought as part of a Christmas gift for 4 year old niece. She's big into ballet and dance and just loved this! It's very fluffy and full and since it has an elastic waist it is something she can wear now and into the future. This was about knee length on her. This would also make a cute piece for a costume. Would recommend!", "overall": "+"}
{"reviewText": "I bought this tutu for my daughter as a piece for her Halloween costume! As soon as she got she wore the heck out of it!, it is as cute as can be!", "overall": "+"}
{"reviewText": "In my three years old and I loved this tutu. It looks beautiful, good quality, I'm perfect :) I loved it", "overall": "+"}
{"reviewText": "Not a great purchase. I bought this for my four year old. It was a little tight and cheaply made. It will not be long for this world. She is happy with it, but she doesn't know better. I would not recommend.", "overall": "-"}
{"reviewText": "I ordered this tutu for my three year-old niece who loves to dress up as a ballerina. I was pleasantly surprised at the great quality of the fabric and it has held up very well through her many costume changes. ;)I would definitely recommend this item to others.", "overall": "+"}
{"reviewText": "Well, the color that it stated that it was, it was NOT!  The color was more a sea-green color not really turquoise.  This was cute for the price but I failed to look and see that this tutu was not lined.  Boo!  I got this to use as part of an outfit.  However, had it been just for dress up it was fine and priced ok.", "overall": "+"}
{"reviewText": "This tutu worked well for a halloween costume. Pretty well made and a great buy for the cost. Just be aware that the dye lots can be quite different. I ordered two for matching costumes and one was a dark purple and the other was almost a lavender purple.", "overall": "+"}
{"reviewText": "I gave this to my 2 year old niece for xmas and she loves it.  My sister says that it's pretty sturdy too so well worth it.", "overall": "+"}
{"reviewText": "My daughter uses these for dance lessons. We have ordered a few different colors because they are so inexpensive. They're holding up well. My only complaint is that one has to watch being charged separate shipping on each item.", "overall": "+"}
{"reviewText": "I put it on my two year old and it fit great. I put it on myself and it fit as well and I'm 25. Very elastic and bounces right back.", "overall": "+"}
{"reviewText": "This is great tutu at a very reasonable price! I would definitely buy again. My 4 yr old daughter loves it!", "overall": "+"}
{"reviewText": "I bought this TuTu for a Halloween costume. I was hesitant because of not seeing it before buying it and all the cheap ones in the stores for Halloween. I am really glad I did. It lasted through 4 parties and 2 nights of Trick or Treating. It is still in great condition to keep with all the dress up clothes. I don't think it was made for a ballet uniform because it doesn't look that \"straight\" at the bottom.I highly recommend and plan on buying more colors.", "overall": "+"}
{"reviewText": "Love this tu tu for my 2-1/2 year old.  A little longer than what I was expecting, but the elastic waist is durable and tight enough for her, a very good purchasing especially with free shipping.", "overall": "+"}
{"reviewText": "My 4 year old daughter always wants to play dress up. I bought this for her for Christmas and she never wanted to take it off. It is almost a year later and she still has it!! It was well worth the money and has held up this long with nothing wrong with it!! I would recommend it", "overall": "+"}
{"reviewText": "My granddaughter loved the tutu, it was a gift w a dance stage her grandfather made her. The color was great as well", "overall": "+"}
{"reviewText": "The product I received is very cheaply made and a waste of money! I opened the package, which did come quickly in the mail, to find a skirt with a single layer of tool, folded in half and sewn together at the top. No other layers then that. There are some rose petals in the middle of the folded tool and a cheap looking rose glued to the front, with excess glue dripping on the petals. It also clearly says \" Made in China \" on the tag. It's such poor quality, I feel completely ripped off! If I saw this in a store I would NOT buy it, but if I had to, I wouldn't spend more then $3.00.", "overall": "-"}
{"reviewText": "My Niece loved it & still hasn't taken it off since Xmas! Perfect gift for a lil girl who loves to dress up!", "overall": "+"}
{"reviewText": "my granddaughter was twirling within seconds of  opening this gift. It was very well made and should last a while, unless she never takes it off.  By the way she is only  3 and said &#34; I will now dance&#34; .I would definitely recommend this I item.", "overall": "+"}
{"reviewText": "Ordered this for Christmas.  My little girl was trilled.  It fit very well.  She was dancing around the whole room.  Shipping was very fast.  It was a great gift.", "overall": "+"}
{"reviewText": "Bought my 5 yr old daughter these for xmas, and she wears them once a week to dance and they have held up very well.. Very happy with product, will buy more in the future!!", "overall": "+"}
{"reviewText": "This item is a lot smaller than expected and although the description says fits up to a 6x this is definitely not the case. I was disappointed.", "overall": "-"}
{"reviewText": "I purchased this for my grand daughter who is almost 2 and she loves it!  I am pleased with the quality and the price. The delivery was prompt also.", "overall": "+"}
{"reviewText": "My granddaughter loves her tutu!!  She feels like a princess!  It is very study so I don't have to worry about it falling apart! Very cute!", "overall": "+"}
{"reviewText": "It was as described and fit my 3 year old grand daughter perfectly. She loves to play dress-up and this is a good addition to her wardrobe. I received the item quickly and the packaging was great.", "overall": "+"}
{"reviewText": "Our granddaughters are all very girlie, so when the youngest one received this for Christmas, they all wanted it!  Great color and fit for a 2 year old as well as her aunt who is 30!  I would recommend this tutu for all little girls.", "overall": "+"}
{"reviewText": "I BBOUGHT THIS FOR MY GRANDAUGHTER, SHE LOVES IT AND WEARS IT EVERY CHANCE SHE GETS. THIS WAS A GREAT DEAL AND I WOULD SURELY BUY IT AGAIN.", "overall": "+"}
{"reviewText": "you guys should have warned a sista that this tutu is for kids. i didn't know this until i ordered it. Now i got a childs tutu and don't know what to do with it!", "overall": "-"}
{"reviewText": "I bought 2 of these for my grandaughters to wear (as required)as flowergirls in a wedding. They were perfect! Very well made. The other flowergirls parents asked where did we get them. The others bought their girls at a ballet store and were quite pricey & not near the quality. I/we are extremely happy with them & highly recommend them to anyone who needs to buy an excellent tutu.", "overall": "+"}
{"reviewText": "I choose this rating because I received the item damaged, the item stated that it would fit a older child.  The item will fit a child ages 2-5.The item was received when in stated.", "overall": "-"}
{"reviewText": "My daughters love their pink tutus. And for only $2, who can resist? Puffy and fluffy with a sateen waistband. Perfect.", "overall": "+"}
{"reviewText": "IF I could give it lower I would... The skirt did not ship for over a week and I had ordered it for my daughters birthday needless to say it did not make it.  I actually never got it so I will never order anything from these people again.", "overall": "-"}
{"reviewText": "This tutu is a great quality buy. Especially for such a low price. I don't know why the other colors were more expensive", "overall": "+"}
{"reviewText": "I was looking for a tutu that could be the starting point for a collection of \"dress-up clothes\" for my daughter. This tutu was affordably priced and seems very well-constructed. My daughter immediately wanted to start wearing it, and enjoys it a lot. I would definitely consider buying additional colors.", "overall": "+"}
{"reviewText": "I thought this would be cheaply made because of the price, but I am surprised. The trim around the waist is a silk/satin material that is soft on the skin. I bought this for a 3 year old and she fits in it and will continue to fit in it for awhile.", "overall": "+"}
{"reviewText": "Not very good quality, be more specific in size wise because it will not fit everyone, also it is too thin and not what i expected", "overall": "-"}
{"reviewText": "Prompt delivery, and it is exactly as described.  The only reason I did not give it 5 stars is because I haven't washed it yet- so I don't know how it will hold up... Other than that my little girl LOVES her tutus (we got one in light pink also), especially spinning and running in them :)  She's on the little side, so my concern was that it would be too big, but the fit is perfect!  The elastic waist will expand with her as she grows.", "overall": "+"}
{"reviewText": "My 3-year old granddaughter loves it!  I also got her a ballerina costume for her Bitty Baby. Definitely a big hit!", "overall": "+"}
{"reviewText": "I purchased this as a part of the &#34;Princess&#34; t-shirt dress I'm making for my granddaughter.  It's exactly the color pictured and it's very soft.", "overall": "+"}
{"reviewText": "This was a gift for my grand kids, they love it, and will not take it off not even to wash it.", "overall": "+"}
{"reviewText": "Way smaller. Fits infant but not up to 7 my daughter wears a 4-5t and it was tight on her had to give it away so didn't even wear it", "overall": "-"}
{"reviewText": "Very simple...I love it because she loves it. She like the pink color; its a nice, worm and clean pink color...Doesnt look cheap at all.", "overall": "+"}
{"reviewText": "This was  my granddaughter 's Christmas present, and I am told she is very happy with it. Keeps all her jewelry in one place now.", "overall": "+"}
{"reviewText": "I was looking for a perfect jewelry box that can organize my collection and found this one after checking online and in stores. I purchased this primarily because the picture caught my eye and the glowing reviews. Well, I'm not dissappointed when I received it. The box is huge alright, and the many compartments is really helpful in organizing your jewelry, it is well designed. I gave it 4 stars only because it is not heirloom material. If only they constructed it in wood with a nice finish and same lined interior, it would be perfect. As it is, I'd say it is priced a bit too high.", "overall": "+"}
{"reviewText": "I absolutely LOVE this box :) It's got so much space for all my jewellery and is the perfect soft, pink color. The little travelling case is also very practical and has enough space for your favourite jewellery. I would highly recommend this product.", "overall": "+"}
{"reviewText": "This was a gift for special young lady who loves jewelry and loves pink! She loves this jewelry box with all of its little compartments and special spaces for her jewelry.", "overall": "+"}
{"reviewText": "I love the product and liked that it is of a good size. Big enough to hold enough of my jewelry. It holds alot of my jewelry, however, I gave it four stars because I would have liked it even better if my necklaces were able to fit on the two side doors. the pins are too short so I either had to wrap my necklaces multiple times or store them in one of the other compartments.", "overall": "+"}
{"reviewText": "This was everything as advertised,it is exactaly what I was looking for. I got it for my eight year old grand daughter and she loves it and it will last for many years.", "overall": "+"}
{"reviewText": "This jewelry box is just right for my small collection of jewelry as each compartment is exactly what I needed.", "overall": "+"}
{"reviewText": "I have ordered this for my friends daughter and it is the perfect size pink leather jewelry box. It is very good quality and looks exactly the same. I am very satisfied with the product and with Shining Image. I got the product in a very good shape and on time.", "overall": "+"}
{"reviewText": "This is a nice jewelry organizer but it's far from being &#34;huge&#34;.  It's an attractive item so despite my disappointment at the size I decided to keep it and use it practically on a daily basis.  I guess next time I order I'll pay more attention to the dimensions.", "overall": "+"}
{"reviewText": "The minute I saw this my heart skipped a beat. What a nice case to sort my collection. I love all the compartments and the layout too. You will love this color too. If this is a gift do not hesitate. It will please even the most fussy, as I am. The price is fair if you check around as I did. Seems well made too. It is suitable for an adult though. Not meant as a toy. This is for serious jewelry lover's. Buy it.....", "overall": "+"}
{"reviewText": "This jewelry box is of cute color and good quality. It provides plenty of slots to put in different kinds of jewels. Additionally, there is a small travel-size jewelry box. With it, it is easy to carry my favorite braceletes and necklaces when traveling.", "overall": "+"}
{"reviewText": "I love pink, and this box is a beautiful shade of it. The handle makes it very convenient to pick up and carry to the dressing table or bed. All closed up, it's just as cute as can be. I'm very pleased with the overall looks of it. I've never had hanging storage for my necklaces before, and I do like this feature. The only fault I find is with the earring storage area that has plastic inserts. Nine holes per insert, which means I'd have to separate one pair. Having to attach the earrings through the holes is bothersome, too, and the plastic is just ugly. I'd much rather just have the little divided spaces to drop the earrings into.  I've removed the inserts (they just slide up and out) and am using the space for something else.I'm not sure how useful the little travel box will be, but it's cute, and it's kind of neat that it will fit right into the box or can be left out and that space used to store something else. I was a bit shocked when I started looking at jewelry storage prices, and I believe this item gives a lot of good storage for the money. And, (can I say it again?) it's just so darned cute - at least in pink!", "overall": "+"}
{"reviewText": "This was a great find. All my jewels are in one spot and can take and go when ever I need to.  Couldn't be happier.", "overall": "+"}
{"reviewText": "This is probably the best and most efficient jewelry box I've ever owned. It's pretty pink color and padded leathery lushness is all I needed to make me feed my inner rainbow and ponies-loving little girl. It has tons of room and is very well equipped to store quite a bit of jewelry. If it has one flaw, the main clasp on mine is a bit hard to latch. I think it comes in other colors if you're one whom pink does not speak to ;)", "overall": "+"}
{"reviewText": "Love this Jewelry Box  so well put together holds plendy... Love the pink & looks so nice on my vanity.", "overall": "+"}
{"reviewText": "I got this jewelry box for one of my granddaughters (7 yrs. old) for Christmas. She loves it! It has lots and lots of drawers and spaces to put all her special jewelry. She likes the little removable box that she can take with her. It was just what she wanted.", "overall": "+"}
{"reviewText": "This products is great for anyone with a lot of jewelry my girlfriend has a lot and this gift for her was one of my best ideas! i recommend this to any one with a lot of jewelry", "overall": "+"}
{"reviewText": "I already own this particular Shining Image jewelry box in brown, so this was my second buy. It arrived with some of the leather scratched, even though it looked like I was the first one opening the box. This particular color pink also looked pretty bad in person. The quality of this box seemed lesser than the brown one I own.I returned this pink case for a refund without a problem.  Got another brown Shining Image jewelry case and it's fine!", "overall": "+"}
{"reviewText": "I love this jewelry box. It's absolutely amazing. There's room for everything you could possibly imagine. It even comes with a key that is used for locking up the jewelry box if wanted but if you don't want to you can just close it shut. This is literally one of my best purchases. Hope this makes everyone's decisions easier.", "overall": "+"}
{"reviewText": "Perfect gift for a little miss who loves jewelery and Pink! Jewelery box has lots ocof compartments and I'm sure she is going to love it.", "overall": "+"}
{"reviewText": "Loved this jewelry box.  it was a gift for my Granddaughter,  She loved it and being younger (11) she loved the color", "overall": "+"}
{"reviewText": "I bought this for my granddaughter, who will be five soon. After I got done inspecting it- I said \" I did good!\". I think she will love it. Lots of compartments of various sizes and dividers. I thought the quality was excellent! I can expect she will have and enjoy this for many years. Read instructions the 1st time you open it 1st. Great value, and very well made.", "overall": "+"}
{"reviewText": "Highly recommendable product! Loved itDon't think twice just go n buy w/o any hitch. Complete Feminine Make up box", "overall": "+"}
{"reviewText": "Very nice jewelry box. It has many different compartments with space for many different types of jewelry. It all packs neatly into a portable case. I bought it for my young granddaughter, and I expect it could last her for a very long time. It is suitable for a young girl or for an adult. The order was filled very promptly.", "overall": "+"}
{"reviewText": "I got this as a gift and I couldn't ask for anything more. I've been looking for a great jewelry box for years and this is perfect- spacious, great organization, and good looking. I love it, couldn't be happier. I definitely reccomend buying it.", "overall": "+"}
{"reviewText": "Order this for my niece.  It is a very nice jewelry case that will grow with her as her jewelry collection grows.", "overall": "+"}
{"reviewText": "I have a similar box for myself, and my daughter wanted one for her birthday.  So I got this one and she loves it.  Great gift.", "overall": "+"}
{"reviewText": "This is a great jewelry box. Definitely has a lot of room and a lot of little boxes/spaces. I couldnt be happier with it. It accompanies me on all my travels.", "overall": "+"}
{"reviewText": "I got this jewelry box for a young lady and her favorite color is pink.  She loved it.  I was very glad I purchased this.", "overall": "+"}
{"reviewText": "This jewelry box is perfect for my daughter. She is 8 years old and needed something secure enough to keep her little brother out. This jewelry box is just perfect for that task. I'm so happy with my purchase.", "overall": "+"}
{"reviewText": "This was a great gift for a preteen!Easy to use and organize all her jewelry.I know she will use it for years to come!", "overall": "+"}
{"reviewText": "this box is elegant and completely functional, I guess my only complaint, which is my fault, is that all the compartments are quite small.  If you have chunky jewelry like my wife has then this box cannot accommodate your jewelry. other than that its fantastic", "overall": "+"}
{"reviewText": "I received the pink jewelry box yesterday and I love the color and it doesn't seem cheap to me at all, although the \"traveling box\" inside did not want to open so I had to take scissors to it to even get it opened. But I didn't need that because I bought this as a traveling jewelry case. I would say this is a good jewelry box for children or for those who only have fine jewelry. But if you have a lot of costume bling jewelry like me this isn't made to hold all of your jewelry. All of the jewelry I am taking with me on vacation fit but my necklaces and I had to do a few rearrangments with my bracelets. So now I have to come up with a different way to travel with my necklace collection. But over all this is a good product and the smell they speak of is just the new smell and my husband was surprised at all I could fit in but like I said I took the small travel case out and had to rearrange a lot of my bracelets and bling earrings. Good for traveling case and childrens jewelry case. This product is not for permanant home use for a complete collection of costume bling jewelry. Oh, yes the necklace holders can only hold small necklace chains.", "overall": "+"}
{"reviewText": "The box is GREAT in the inside, but lacked more detail and or creativeness on the outside. Overall a 4 star. thank you", "overall": "+"}
{"reviewText": "I just received this item today-I ordered it Monday night!  I am very pleased with it, and it does look better in person.  I gave it four out of five stars due to the little plastic inserts located on the top right rear section of the jewelry box, which had a weird smudged coating on it that I tried to clean off.  I ended up not using them, since I needed the room, and the inserts were only in the way.", "overall": "+"}
{"reviewText": "I got this as a gift for my GKid and she loves it.  Her jewelry was every where in her room so now she can keep it all together.  Plus she loves the take-with-you piece.  When she comes to visit she can bring a couple of items and know they are secure.  I am thinking about getting one my some of my jewelry.", "overall": "+"}
{"reviewText": "Lots of room for jewelry! There are many compartments! I love the pink leather. It also has a cute travel jewelry box that I use while going away for small necklaces and earrings. I especially love the side openings that hang necklaces!", "overall": "+"}
{"reviewText": "Bought this for my daughter and It is very nice, the only thing is the lock did not work, other than that it is made very solid.", "overall": "+"}
{"reviewText": "I ordered this for my niece's fifth birthday.  She just got her ears pierced and has a few pieces of real jewelry that are nice.  I knew she was getting some earrings for her birthday and would need a place to keep them.  I love this because it is a real jewelry box, but has lots of great features for a little girl too.  The mirror is great, the pale pink color is great and the flip open sides are great as well.  There is tons of storage so she can use it for years to come and even as a teenager without being embarrassed by cartoon artwork that she was into as a child (I almost got a Disney princess one, but thought better of it).  She could even use this as an adult and keep it for her daughter since its made of leather and is well constructed.  The little removable box is great for travel and she's already used it to come visit us for the Fourth of July!  The travel box has a place to slide a little plastic panel with holes in it for earrings!  I am very happy with this purchase and my bling loving, mature niece loves it too.  She feels like a big girl and now I can help her fill it up every birthday and Christmas!  It's a win-win!", "overall": "+"}
{"reviewText": "Bought this for my wife, was a little disappointed by the appearance, \"leather\" looks very cheap and is tacky. Most importantly, the two buttons holding the side pockets fell apart on first use, so now the sides flap around anytime the box is moved around.Would most certainly never buy this item again, because I did not expect such a poor quality from reading all previous reviews. My wife is happy though as it has plenty of space, but I feel like I wasted a lot of money and should have looked around (and maybe paid) more to get something that lasts a little longer than 10 minutes.", "overall": "-"}
{"reviewText": "Lots of little compartments to keep your jewelry from becoming entangled. Very Easy to clean exterior. Also the perfect color.", "overall": "+"}
{"reviewText": "Purchased for my granddaughter 11 yrs old.  I was very surprised at how beautiful this is.  Suitable for an adult.  I may get one for myself.", "overall": "+"}
{"reviewText": "Gave this as a gift to a pre-teen.  She loves it. However I do have to agree with some people that certain areas of this box were poorly made.  I noticed seems pulling apart - just when I received it and opened it to check on it. I re-glued them, but the initial job was poor and considering that I'd say a bit overpriced for what it is.", "overall": "+"}
{"reviewText": "I wanted to have the title summarize my thoughts if you decide not to read the entire review.  My granddaughter likes the Shining Image Jewelry Box given to her for a birthday gift from Grandma.  I wish the drawers were deeper for holding her many necklaces.  Also, I wish the drawers had a stop, preventing the drawers from tipping contents entirely when trying to remove one piece of jewelry.  My granddaughter is only five years old, so having the background knowledge of knowing when to stop the action of pulling the drawer from the base requires practice.  I, on the other hand, have had lacks of years of practice with jewelry drawers, but also struggle with removing the drawer without spilling the contents.", "overall": "+"}
{"reviewText": "This box holds all my jewelry in one place, so many compartments in a very  portable case, I am very happy with the case and the price is good.", "overall": "+"}
{"reviewText": "The colour is cute and the box is better than I was expecting. The only problem  is that it is a little bit heavy so it is not the best option if you want to use it when you travel by plane which has a limited baggage option.", "overall": "+"}
{"reviewText": "Received this item in two business days. It looks exactly like the picture. Big box with a lot of spaces to put jewlery, but slots and drawers are kinda small. But I didnt mind at all since I don't wear big jwelery. Material is very nice also.", "overall": "+"}
{"reviewText": "It wont last a lifetime but it is cute and serves it purpose. It has many spaces to put jewelry! very cute!", "overall": "+"}
{"reviewText": "The lock/latch on this is pretty chintzy, and overall it is a pretty cheaply made. But I purchased this for a young teen, and she liked it well enough, probably owing to the fact that bubble gum pink is her favorite color.", "overall": "+"}
{"reviewText": "It is a pretty box but not so useful.  The drawers fall out if you pull them too far .", "overall": "+"}
{"reviewText": "Very nice storage and organizer.  I did, however, expect it to be a bit larger.  It is very heavy duty and a nice way to protect jewelry.", "overall": "+"}
{"reviewText": "Nice piece, but thought it appeared bigger in photo.  It works fine.  I could have had some knobs on the bottem to stand on because we wanted to use it in the bathroom and it gets moist in there.  Water under the box would have started mold.  We use in the bedroom instead.  Great piece.", "overall": "+"}
{"reviewText": "I bought this jewelry box for my granddaughter! She was having problems putting her jewelry away and always losing some. So I bought this for her. She absolutely loves it and so far, has been putting her jewelry away!", "overall": "+"}
{"reviewText": "Best jewlery box of all time !!! It is huge and it closes up well Nd comes with a key and has so much compartments for my jewlery which is amazing for me because I am a major jewelry girl lol not to mention the box is so elegant and beautiful i really think it is worth it especially if you have a lot of jewlery to organize .", "overall": "+"}
{"reviewText": "I purchased this gift for my daughter over a year ago for her 7th birthday.  She loves the jewelry box and does really well and keeping everything organized.  It offers a lot of storage options.", "overall": "+"}
{"reviewText": "This is awesome! Tons of space, very classy, cute as can be. You will not be disappointed what-so-ever. Great quality. Looks wonderful in my closet.", "overall": "+"}
{"reviewText": "This is a Awesome Jewelery Box where i can store All of my jewellery. and very easy to access for daily wear also. I gave the 4 stars because i got cherry color one instead of Pink though i loved it.", "overall": "+"}
{"reviewText": "This jewelry box is truly a good purchase.  It is spacious and of great quality.  While my grandchild was thrilled with this gift the adults who saw it said, \" I would like to have that for my own!\"", "overall": "+"}
{"reviewText": "I had read a review from someone who had purchased three of these boxes for her nieces.  She stated that she thought this box might be intended for the younger set.  Well, maybe she's right. Maybe I'm just extra young at heart! I love my new jewelry box. I even bought it in the pink (it comes in black and camel). It is roomy and holds lots of pieces within a relatively compact case. It has lots of room for earrings. That is primarily what I own. I don't wear rings, and I only have a handful of necklaces and chains. It also has an absolutely adorable carrying case for travel. This jewelry box also has a mirror under the lid and the whole case folds up and locks securely! I love it!  Before I bought this, I had kept my jewelry in an assortment of little ceramic boxes that cluttered up my dresser.  Now, all is consolidated into a single, attractive case that fits nicely on my dresser. I am very satisfied with my choice.  I might add that I looked at almost every jewelry case that Amazon offered and I kept coming back to this one. The price was right and the product is wonderful.  Don't be misled by the color in the pictures.  The color I purchased (the pink) is even prettier than depicted.", "overall": "+"}
{"reviewText": "Bought it for a christmas present for my granddaughter. She loved it.She liked the fact that it came with a key and she could lock it.", "overall": "+"}
{"reviewText": "Really nice box, a bit cheaply made. It is made of carboard with pleather. Although the organization for all your jewelry is great, I'm not so sure how it will stand up to my tween daughter's use. Every inch is useable space for jewelry & very compact, which is a nice feature.", "overall": "+"}
{"reviewText": "Got this as Christmas gift for my great niece & she loves it.  It is very pretty and it will hold a lot of jewelry. I'm thinking about ordering one in a different color for myself!", "overall": "+"}
{"reviewText": "Great quality for the price. I gave five stars because it was the most affordable leather jewelry box and it had enough space.However, there was sticky residue on the ear ring holders.", "overall": "+"}
{"reviewText": "I bought this for my wife for all her jewerly not sure if she would like it or not because she is very picky when it comes to stuff like this.To my happiness, she loves the jewerly box very much even though its not the standard &#34;wood&#34; box.The jewerly box is very sturdy and large to hold a million pieces of jewerly.It is very big, so we added a shelf in our bathroom where the box sits with a mirror above which is perfect for her.This box also comes with a travel box, which is very nice to hold the jewerly needed when going on vacation.Overall, I would recconmend this box if your woman would do without the traditional &#34;wood&#34; jewerly box.", "overall": "+"}
{"reviewText": "The color is very pretty! The pink is a nice change ups from the usual black or brown boxes ou typically find, it is a sofisticated pink. The box itself is extremely spacious, I personally think it is larger in person than what you see in the picture. The lock is a nice feature, but it is pretty flimsy, you can unlock it without the key very easily, but that is of no concern to me. It is a very solid box, and could stand up to traveling without a problem, you could probably throw it full force at the wall and not damage it lol. I also enjoy the mini box that comes with it. I don't normally bring jewelry with me when I travel, so I gave it to my little girl to use and she loves it.", "overall": "+"}
{"reviewText": "Love it.  Best jewelry box I ever bought.  I definitely recommend  this item, you will not be disappointed.  I 'm not.", "overall": "+"}
{"reviewText": "I received it really quick . I did not expect that box so big . Little bit heavy . Looks pretty . I like this box because there is a lot of space for ear rings but not much space for braclets . I am satisfied .", "overall": "+"}
{"reviewText": "Although the gift was loved, it was broken within two weeks!  The box was lifted up by the handle, and the cheap lock did not engage so the box opened, all the drawers fell out and the pink thin leather tore away from the cardboard frame, leaving the top and back exposed to gray cardboard.  ugh!When I shipped it back for a replacement, thinking it was likely a once in a lifetime accident, they instead refunded my money... and did not email me a single note about anything! I had to find out by checking my bank account, and even then, they only refunded $10 of the return freight when it was nearly $30 to ship back!So, when I went back to REPLACE the case, as I originally requested, they said SURE!  BUT ...  it will cost you more!  In fact, between the cost of shipping it back (exactly $28.77) and the higher cost of new re-purchase (more than $20 more), the box would have ended up costing me a total of OVER $100 FOR THIS CASE!  A CASE THAT FELL APART WHEN LIFTED BY THE HANDLE!  Fooled me once ... never again.BAD PRODUCT QUALITY.  WORSE RETURN POLICY.  RUDE EMPLOYEES. I will NEVER buy ANYTHING from these people!  Amazon was no help either -- so much for their A to Z policy!  HA!  They don't vet these companies worth a dang, and then pass on the crappy vendors to customers. Boo Amazon!  And a triple boo to Shining Image!", "overall": "-"}
{"reviewText": "i bought this for sister in law for christmas. she likes it. she uses most of the stuff in it. comes with a lot of stuff", "overall": "+"}
{"reviewText": "I found the jewelry box to have a lot of space and the lay out was perfect. I plan to buy another one as a gift for a loved one.", "overall": "+"}
{"reviewText": "This was a gift for my niece.  Once I received it, I wanted one for myself. It has so many compartments and so much space. It is very cute. I'll most likely be getting one for myself in black.", "overall": "+"}
{"reviewText": "While the product title states this is a &#34;huge&#34; leather jewelry box, it is in fact not huge.  It is an OK size.  I was expecting something a bit larger.  That is my only reason for a 4, instead of 5, star rating.  The box itself came in great condition and packaged well.  It seems durable and will work out great.", "overall": "+"}
{"reviewText": "Got it for my daughter's 6th birthday, and she loves it!  It's GREAT!  Made very well, packaged very well. Just an all around great jewelry box!", "overall": "+"}
{"reviewText": "It was a hit with 8 year old grand daughter. I added a couple of dollar store jewels to be found.", "overall": "+"}
{"reviewText": "Going off to college, I got this jewelry box to store everything in. It has been so amazing! There is a ton of room; I have not been able to find any other jewelry box like this with so much room. It fits everything I wanted to bring with me, and is really easy to store. Also, very cute! I highly recommend it.", "overall": "+"}
{"reviewText": "Bought for my 4 year old granddaughter to keep for years. My wife loved it! I'm sure it will be with her for a long time. Well built and thought out.", "overall": "+"}
{"reviewText": "The inside removable box closer was stretched and so loose and not usable. When I close it, and pick it up, there're at least 1 to 1.5 inch hanging there and 2/1 inch opening where jewelry can fall out.Color is nice light baby pink though.Although the item came on time, I just was so disappointed to receive something broken after spending $50. It's not fair.", "overall": "-"}
{"reviewText": "I bought these with hopes they would not have large frames. I will be returning them as they were the average size & not small as described and they were also very cheap looking. They did arrive quicker then expected so I do not have any complaints with the seller.", "overall": "-"}
{"reviewText": "Love these.  Very sporty and great price.  The only thing is the pictures shows the top being straight across but they are a little curvy on top.  Still very cool.", "overall": "+"}
{"reviewText": "First of all, the item I received did not look as pictured. Instead of of a shiny stainless steel look, it is a matte, rough, and cheap looking metal. The button that opens the latch is the same color as the case, not the brass color in the image. Overall the case feels poorly made and it had been crushed a bit in shipping it seems since the latch takes a lot of force to properly close.Just as important as the looks, is the fact than the case is actually a bit smaller than described.I measure the exterior at 146mm X 54mm. More importantly (and I don't know why sellers don't ever provide these dimensions) the interior dimensions are even smaller, so my glasses don't fit. I measure the useable interior space at 130mm x 52mm x 27mm (at the widest point then tapers dramatically because of oval shape).", "overall": "-"}
{"reviewText": "Everybody has black wayfarers, so having a pair with gradient lenses will make you stand out. And, I think it actually looks cooler. For the price, these are fantastic.", "overall": "+"}
{"reviewText": "With all the hipsters out there, I guess I should not have been surprised that when these came, they were just clear lenses.  I ordered 250 s. They were cheap, so whatever.", "overall": "-"}
{"reviewText": "I received these sunglasses within a decent time-frame (shipped from Europe). They arrived with a quality draw string storage bag, cleaning cloth and security strap. They are well crafted, classy and attractive to wear, the only drawback is the lens aren't as &#34;purple&#34; as the picture portrays, the lens are a bit darker purple (almost black) in person but block sun rays very well. Overall I am pleased with this purchase and will be wearing these sunglasses everywhere!", "overall": "+"}
{"reviewText": "Got these on Amazon for my father. The right size and the right color lens  that he was looking for at a great price. Thanks so much!", "overall": "+"}
{"reviewText": "It is a great size for traveling and definitely chic looking. It is worth the purchase and I use it often", "overall": "+"}
{"reviewText": "I Love it and bought more for friends Came fast and as described.Will be a returning customer. Very Happy. AAA+", "overall": "+"}
{"reviewText": "It is exactly as is pictured, but I must say I like the choker from Twilight better than New Moon. New Moon's is lighter in color and much shorter.", "overall": "+"}
{"reviewText": "I bought this thinking it was thick and will keep me warm this winter, but when I got it I was pretty much upset how thin and sheer it is. I was also disappointed on the size, the seller said it was a large size, but the hood is rather tiny and  it's a little small on me! It's also made cheaply cause the fabric sheds little white fibers from the sweater jacket. I also looked on the website,[...] and saw how hig it is on the models !  Maybe it's for little petite girls to wear, I loved the hood, it has little ears.  But over all, don't waste your money on this! It costs about 35 for it!  Look elsewhere !", "overall": "+"}
{"reviewText": "I ordered two of these for my grand daughters and they are extremely cute. The girls love them but the fabric is thinner than I expected and they will sadly not stand up to real cold weather. OK for a California winter but not for skiing.", "overall": "+"}
{"reviewText": "I absolutely love this purchase. The ears are a little smaller than in the picture, other than that - I'm super happy with this item!  It's lightweight, yet warm - great for clubbing or to wear to the mall shopping etc. Great for a ski or snowboarding trip to wear around the lodge or under your winter jacket for layering. The sleeve ends are matching elastic cloth as is the bottom of the jacket so it hugs your waist, has 2 pockets, durable zipper, the pom pom ties are ADORABLE!  Just like the ad says, the sizes do run more on the small side, but zip up hoodies are pretty universal sized for the average young adult or woman. Basically one size should fit most unless your really big or really tiny.  I've looked around for a long time trying to find one of these and they do seem to be hard to come buy. I recommend this item - they tend to be seasonal, so if you wait, they will be gone!", "overall": "+"}
{"reviewText": "Cute jacket!", "overall": "+"}
{"reviewText": "Great product! This is exactly the kind of thing that would be impossible to find in stores but you can search on Amazon and find it easily!Pros:- Blank cardboard pieces that are easy to write on. (I would recommend permanent fine-tip Sharpies or colored pencils, anything else might bleed too much)- Decently thick piecesCons:- Pieces don't come apart cleanly.- All 12 in the pack are identical. (This could actually work to your advantage if you screw up on one of the pieces you could easily substitute. However all 12 being the same is a little overkill)Overall:It's a great, unique product and I'm glad Amazon made my life a lot easier so that I could find it and use it in my proposal!", "overall": "+"}
{"reviewText": "Fun to color and gift to parents on Mother's or Father's Day.  As a teacher, I've heard from moms and dads about how they loved receiving the puzzle.", "overall": "+"}
{"reviewText": "these are a neat idea but they are very very thin. I wanted to glue a photo to them and cut it out but they wouldn't work", "overall": "-"}
{"reviewText": "I bought this for my niece who loves to draw on everything! So I got her these puzzles and now she can create her own picture to put together great price for the amount you get", "overall": "+"}
{"reviewText": "Product cheaply made. Was hoping for a smoothe coating and turned out to be cheap cardboard. Ordered from Oriental Trading-------- much better product and more for same money. Would not order this again.", "overall": "-"}
{"reviewText": "These puzzles have worked great for our Chronological Bible Discipleship class. We use them as an intro for each weeks lesson on the eras of the Bible. They seem to be pretty sturdy and just the right size!", "overall": "+"}
{"reviewText": "I am going to decorate these puzzles to announce a very special Christmas surprise.  I am so glad I found them.", "overall": "+"}
{"reviewText": "Just what I was looking for.  I do a scavenger hunt at Christmas and this was part of one of the clues. Also itis perfect for my new upcoming artists in the family. May have to get more.", "overall": "+"}
{"reviewText": "The pieces are small and they are cut well, but stick together long enough to draw, paint, color. Thanks you.", "overall": "+"}
{"reviewText": "These blank puzzles are great for kids.  In the words of my child: \"You get to be the artist...it's really fun to be the puzzle maker.\"", "overall": "+"}
{"reviewText": "I bought these puzzles to use in elementary classrooms for a lesson on getting along.  They really enjoyed making their very own puzzle.", "overall": "+"}
{"reviewText": "I got this to draw a map for a birthday gift ... it just worked perfectly ... its nice idea", "overall": "+"}
{"reviewText": "I'm disappointed this doesn't specify the number of pieces per puzzle.  From the image it appears to be 24 pieces but I would like to be sure of that before ordering.", "overall": "-"}
{"reviewText": "The tee shirt transfer did not adhear to the puzzle.  I tried several times but never could get a satisfactory result", "overall": "-"}
{"reviewText": "NOT WHAT I EXPECTED.....I BUOGHT THIS AS A GIFT FOR MY 10 YR PLD NEICE....NOT THE BEST LIKE I SAID", "overall": "-"}
{"reviewText": "How can someone buy this item if they have absolutely no idea what size the ring is? Pleasse post some information about this.", "overall": "-"}
{"reviewText": "This has to be one of the most frustrating toys. Ours is the version with Winnie the Pooh books, but the hardware is the same. In theory it is a good idea, but it does not even come close to living up to that. Ninety percent of the time it will not recognize that there is a book inserted and will keep repeating, \"Please insert a book.\" When it does start to read you only have to jiggle the book ever so slightly for it to ask for a book again.The \"cover\" of the system comes apart from the base very easily.I would not recommend this toy at all.", "overall": "-"}
{"reviewText": "It does nothing but saying \"bye bye\" after a long silence.Quite odd, isn't it?I returned it to amazon after trying for a few times.Awful toy.", "overall": "-"}
{"reviewText": "I just bought this for my grand daughter and it does not work.  I called the 800 number on the box they knew nothing about the toy and are sending me back to the store.  What a joke?", "overall": "-"}
{"reviewText": "I bought this fir my daughter at Sams and it just tells me to insert a book unless she has it on the last page then it sings a song or asks her questions  depending on the play mode.  My 19 month old enjoys the item I just wish I right hear the same thing over and over", "overall": "-"}
{"reviewText": "I really wanted the shapes and the pattern cards.  The description is vague and the picture depicts both the shapes and pattern cards.  I tried to make the best of a bad situation by trying to find the corresponding shapes and have not been able to do so on Amazon, multiple school supply company sites and even on the Ideal Company site itself.  The cards are utterly useless without the shapes.", "overall": "-"}
{"reviewText": "I incorrectly assumed that the Pentomino Tiles would come with this product but they do not therefore this product was essentially useless for us.", "overall": "-"}
{"reviewText": "Starts with matching exercises with no explanations of what the words mean. I found this product expensive. It did me no good.", "overall": "-"}
{"reviewText": "Never really tried to use the online version but after receiving a trial CD of how to speak Dutch I decided to give the online one a try for Arabic.  I should of stuck to what I knew.  The online version is a joke if it's anything like this level one version here.(which I image it is the exact same product  It's just pictures and done way too formal.  Rosetta Stone has had success with some languages but Arabic is a total waste of time and money.  My friends I told laughed at me for how I was pronouncing words and phrases.  If you want a more authentic feel to it try Rocket Arabic's course for a fraction of the price.  I have listened to a few of their lessons and their structure and explanation make waaaaay more sense than what Rosetta Stone tried to do.  I am now in an email battle with hope trying to get my money back for the online course I tried.  Should be no contest being that they \"stand behind their product with a money back guarantee\", figure they'd do the same with all their products.Again, don't bother with this.  Arabic is not a language you can dumb down and learn looking a pictures and have no clue what you are doing.", "overall": "-"}
{"reviewText": "Okay, I do actually own this product, and I have also been a student of Arabic for some years now. I really would not recommend Rosetta Stone products for non-European languages for several reasons, but I focus on the Arabic here (and I assume the learner is a native English speaker):-The type of Arabic this teaches you is called Modern Standard Arabic (MSA) or Fusha. This is the \"higher register\" of Arabic which is used in formal settings by the educated class: the news, academics, some clerics, most literature. Generally, Arabic speakers use a local dialect of Arabic, which is very, very different from this version of the language. For instance: imagine reading a work of Medieval \"Middle\" English. The language would be mostly quasi-familiar English words, but most of the usage, pronunciation, and grammar would seem tricky, overly complex, or old-fashioned. You would be able to understand some of it, but would miss a bit, too. \"The sky is blue\" would be like \"de heofon ist hewn bleu.\" MSA is like that to 90% of Arabic speakers: not totally gibberish, but not approachable either. Don't misunderstand me though, all Arabic learners should learn MSA, but know that you won't be speaking it much.-The reverse is also a problem. You can speak all the MSA you want (from Rosetta Stone or elsewhere) but almost no one will speak it back to you, and some people will literally laugh in your face for speaking that way. None of the living dialects of Arabic are that close to MSA, so even if you memorized every word of Rosetta Stone Arabic, you would not be able to understand almost anyone who didn't go to university.-To make matters even weirder, Rosetta Stone Arabic included the highly complicated case endings (called Iraab) on all the words. That is to say, there are certain changes to the last vowels of most words in the most formal of formal Arabic literature, like the Qur'an, the Bible, and poetry. These case endings mark what part of speech is being used, so for example \"kitaab\" is \"book,\" \"kitaabun\" is \"book\" if it is the subject of the sentence, \"kitaabi\" is \"book\" if it is direct object, \"kitaaba\" is \"book\" if it is in a prepositional phrase, etc. It is very complex and NO ONE EVER, EVER SPEAKS THAT WAY, even in MSA. Iraab use is technically correct, but even native speakers get confused by it (and rightly so). Not only does it not reflect any normal Arabic speech, because Rosetta Stone does not explain any grammar directly, I seriously doubt anyone would be able to sort out the meanings of the case endings just from context. This one was a major blunder that is mind-boggling for such an expensive product.-More on the grammar bit: it is great that Rosetta Stone wants to avoid speaking English, but Arabic grammar is not intuitive for English speakers. Therefore, unless you already have a fair bit of Arabic grammar, you will be completely confused. For example, in Arabic there is a system of root letters that make up most words. The pattern of these roots changes depending on meaning, so if a book is \"green\" it is \"akhdar,\" but if a car is \"green\" it is \"khadr'.\" Unless you already know that Arabic has a masculine/feminine gender system, and a root for greeness based on the letters kh-d-r, you would not be able to deduce what was happening (I really, really doubt it anyway.) Arabic has lots of grammar that throws English speakers for a loop and needs to be explained directly and in detail: there are tons of ways to pluralize, a \"dual\" case between singular and plural, a very different sentence structure, and on and on.-There is no cultural context provided, which is really strange. Why would I need to know the word for \"sandwich\" in the formal register of Arabic? Why does it teach how to say someone is \"Russian\" or \"Japanese\" and not how to say they are \"Jordanian,\" \"Saudi Arabian,\" or \"Moroccan\"?I could only imagine two reasons someone would find Rosetta Stone Arabic useful:1. If they already spoke some Arabic and wanted a refresher course in the more formal parts of the language, which I guess could happen.2. They wanted to focus specifically on Arabic literature of some sort and already had some familiarity with Arabic grammar and syntax.Do not buy this product if:1. You want to learn Arabic from scratch on your own. You will learn nothing at all, I swear.2. You are traveling to the Arab world and want some basic speaking skills.3. You want to learn about Arab culture or the language's use and history.I didn't intend to rant but this is a very expensive product and it really is not worth the cd its copied on. If you want to learn MSA or one of the many dialects (or better yet, both), get a dictionary, a class, and a plane ticket.", "overall": "-"}
{"reviewText": "Thinking I would help get a head start on an Arabic course I was taking over the summer I purchased Rosetta Stone Arabic Level 1 back in the spring.  I feel like I've been cheated.  I paid almost $200 for a virtually worthless program.  If you cannot read the Arabic alphabet you are pretty much screwed.  Lesson one starts with an Arabic phrase popping up on the screen, which you repeat.  Regardless of how you pronounce it it gives you the green light then continues.  It repeats a phrase, then you select one of the four pictures below.  You figure it out after failing for a while that they are saying boy, girl, man, woman, etc...  Bash your head against the keyboard for a bit longer, then you go on to another lesson.  You are given no grammar, no explanation of what you are saying or doing.  It's immersion alright, but with no practical application.  Did I mention it's MSA(Modern Standard Arabic)?  If you do figure out what you are supposed to be learning, try whipping out some awesome MSA to a native speaker of Arabic and watch them try to smile and find a polite way to let you know you sound like an idiot.  I will never buy Rosetta Stone products ever again.", "overall": "-"}
{"reviewText": "After learning Spanish the &#34;old fasioned way&#34;, I find Rosetta Stone to be useless. The pictures are often unclear, and it keeps showing the same one every time, meaning that you can just associate the pattern of letters with the picture without understanding anything.", "overall": "-"}
{"reviewText": "After I brought this program, I did not use it until two years later, to my horror it said the program needs to be renew, it expired! I need to buy another new program. I call customer support, and they want me to buy another same program. I would never buy rossetta stone again.", "overall": "-"}
{"reviewText": "I have just received the package but I can not try it yet because ROSETTA STONE ONLY ALLOWS YOU TO REGISTER THE SOFTWARE ON 1 COMPUTER!!!  I now have to haul my work laptop home everyday just to try this program so that I can also use it in work environments.  I know they have to protect their software, BUT COME ON, at least let your users register it on at least 2 computers!This is not starting out well.  I hope things go better from here or I might have to take them up on their money back guarantee.", "overall": "-"}
{"reviewText": "I received Chinese 1-3 as a gift and it promised to have online lessons and games. These never activated and thus I was never able to use this product as advertised. I contacted customer support several times and more or less they told me \"tuff s***\". I have since become fluent in Chinese by taking lessons with a local for $10/h. Take my advice, get a Chinese tutor, or take classes. Tutoring and classes from native speakers didn't even cost me as much as this product would have. Furthermore, take the advice of many polyglots like myself and get a different program. This is way over-priced for what it provides. Actually, it may even hurt your progress in learning Chinese. Don't waste your time and money with this!", "overall": "-"}
{"reviewText": "My company purchased this for the employees and after using this for four months and over 50 hours, I am very disappointed with this.First issue and the main issue is that ALL the words have NO English word affiliation on the screen. Rosetta expects you to understand the picture, the hardest are the action pictures, for instance a man is giving a woman red flowers, a word is displayed, what does this mean, \"Giving\", \"Receiving\", \"Flowers\" or \"Red\", you just don't know until later when you go through the process of elimination. This is very frustrating, thinking one way and then being corrected later.The speech recognition is very good and the only reason I gave this program 2 stars.If you are want to learn Chinese, AVOID this program! I have used several and the one I stayed with is the \"Transparent Language\" programs. You can see what I mean for free at the [...] site. You may like something different, but DON'T BUY INTO THE AD CAMPAIGN ON THIS!I hope this helps you.Michael", "overall": "-"}
{"reviewText": "Purchased as a gift, but was told that CD wasn't loadable to the PC and had to go through online download.  Also, the learning method is non-traditional and difficult for learner to follow.", "overall": "-"}
{"reviewText": "It was not clear it was not useable in the car.  It has never worked in the computer.  Help line not available", "overall": "-"}
{"reviewText": "The program itself is great.  The immersion works well, and it is entertaining to puzzle through new words via their scenarios.  Voice recognition is top notch as well.  It's a great learning tool.Unfortunately....  it is saddled with the most onerous copy protection I have yet encountered.  It is so dreadful that it drops my rec straight from 5 star to 2 star.Basically you can only install it twice.  Hard drive dies?  That counts as one.  Upgrade your OS?  Counts as one.  There is a \"de-activate\" function which supposedly returns one of the licenses, but you can only do that if you remember beforehand, or there is not a technical difficulty that prevents it.  The one time I was in a position to try the \"de-activate\" feature it did not return the license.After you run out of your two installs you then have to call their technical support for each and every install after.  If you are a tech type who upgrades systems and OSes frequently this literally results in HOURS of extra overhead spent on the line with indian tech support to get your licenses reinstated.  Hope you kept your proof of purchase all that time as well, without it you now have a $200 yellow coaster.", "overall": "-"}
{"reviewText": "I enthusiastically tried to use this product when learning Chinese in China while working as an English teacher.  Day after day I sat down with this product, and went through the level one modules.  The problem with learning language becomes immediately apparent when you realize you can say things like \"these are two boys\" or \"the table has five plates\" but cannot say tho most basic survival phrases such as \"Hello my name is_______\".  Also I encountered a phenomenon where I could remember the words when using Rosetta stone, but not in real life on the streets and in the classroom.  I thought I was a terrible language learner.Language acquisition research has shown motivation to be one of the highest factors of success in learning a language.  Rosetta stone is extremely demotivating.  It does not teach practical language.  If they included basic survival conversations from the very beginning, this would be a much better product, however the developers have chosen instead to recreate an experience of using an extremely large and onerous set of flashcards.I had used Rosetta stone for four months.  I saw very little progress in my ability to actually use the language.  Then in Shanghai I bought a simple textbook for about $5 that used dialogues with an audio CD included.  I studied this for a week and my Chinese ability skyrocketed.  This was because I was learning the simple survival language that humans use everyday and I desperately needed.Don't believe the marketing hype.  A child learns their first language over a period of about 7 years.  A baby can learn a bunch of random vocabulary words and simple grammatical structures without needing to say things like where is the bathroom?  The child just has to cry and someone figures out what is wrong.  Most adults would like to avoid sitting in a restaurant and crying until someone figures out they need to use the bathroom.  It is extremely demotivating to know how to say \"He takes the red flowers\" but not be able to say \"I want a glass of water please\".  Buy a $20 textbook with an audio CD.  Go through the lessons and listen to the conversations on the audio CD.  Use the rest of your money to pay a tutor to speak chinese with you.  You will learn Chinese and any other language much faster this way.", "overall": "-"}
{"reviewText": "You better have someone on hand that knows how to use the program because there are no instructions for user trying to learn the language. Chinese was chosen as the interface language and it only lasted one screen then everything was in english. If you don't know english don't try to learn it with this.", "overall": "-"}
{"reviewText": "There are many different ideas on the best way for adults to learn a foreign language. Much depends on the student, their goals, and their self-discipline. Dealing with a tonal language or a language with a different script, the student need make some big decisions about how they want to learn, and how much. Relatively speaking, Filipino/Pilipino/Tagalog is easy.I learned Spanish as an adult. I am now fluent at a professional/business level. About 10-15% of Tagalog is Spanish, and the spelling of Tagalog words are all based on Spanish sounds.I learned to read Thai. I can write some, but my vocabulary is very small. 90% of my Thai came from taking private one-on-one classes while living in Thailand for 6 months.I studied some Tagalog, some Korean, and some Thai using Rosetta Stone.If you just want to learn some Tagalog to get around as a tourist, enough people speak excellent English in the Philippines you will probably never be able to use it. The Filipinos who don't speak English will typically avoid speaking to you, even when you try to speak Tagalog. Regardless, an immersion product, like Rosetta Stone, is probably not as useful because much of the vocabulary and context is not related to what you will want to know (do you really need to say the boy is under the soccer ball?).If you want to seriously learn the language to be able to carry on casual or business conversations, commit early and realize there is far more work involved. To really practice Tagalog, you will need to go to less savory parts of Manila, or plan on getting outside of Manila, Cebu, away from the red light districts in Olongapo and Angeles, and avoid the resort areas like Puerta Galera and Boracay. To really use Tagalog, you need to go to areas where those who don't speak English are willing to make an effort to understand you.For me, I first needed to learn the alphabet. Since spelling is based on Spanish phonetics and the Roman alphabet, this was easy for me with Tagalog. For other languages, like Thai, you CANNOT consistently pronounce Thai correctly using Romanized phonetics. T one rules are only consistent in Thai script.  Among other challenges, the Romanization is wildly inconsistent. You learn it one way, and then another source using different phonetics mires you in confusion. The same is probably also true of Korean, as it is also a phonetic language. Learning Chinese will likely be different. This part of Tagalog is easy though.Second, I realized for me, I need to take notes. As adults we want to take notes to help remember key points. If you take the notes in English, you are handicapping yourself. This is more difficult, and far more important, in languages with their own script.Third, again for me, I knew learning translation would create a permanent handicap. Early on, translation is easier, later on translation must be unlearned as it stilts actual conversation and thinking. You just can't translate fast enough. Even now, being fluent in Spanish, translating gives me a headache and frustrates me. I either have a conversation in Spanish, thinking in Spanish, or I have a conversation in English thinking in English. If I know a word in one language and not the other, my whole train of thought is derailed. Avoiding learning translation is where Rosetta Stone shines.I like the idea of Rosetta Stone. If you are disciplined and do the lessons, you will expand your spoken vocabulary rapidly. You will remember what you learn. For reading and writing, Rosetta Stone is limited. I doubt it will do much for reading and writing with non-Roman scripts. Like any learning tool, disciplined study will yield results.Rosetta Stone is very expensive. Competing products like L-Lingo or products using different methods like Pimsleur, TellMeMore.com, Assimil, or Fluenz (supposedly the best, but only in a few languages) are a fraction of the cost of Rosetta Stone. Many of the different methods will work better for some people than others. Assimil is translation based. Pimsleur is hard to describe, but has a very good fluency success rate (supposedly). Look up Fluenz also, as the method and reviews suggest it is very effective in the few languages they offer.Besides cost, what is the other drawback to Rosetta Stone?The drawbacks are legion.Version 2 is good. Version 2 is how Rosetta Stone grew into a powerhouse. The voice recognition is very primitive. Version 3 is a refinement of version 2 with improved continuity, a smoother interface, better quizzes, and the ability to get rid of the stupid \"must have CD with you at all times\" limitation. You can also advance or return to the exact spot where you left off earlier.Unfortunately, Rosetta Stone dropped support for Version 2. Even though they were selling version 2 from their own website in 2012, they dropped support. Mac users are especially impacted as Mac OSX Lion will no longer run PPC apps, and Rosetta Stone never ported Version 2 to Intel. So, if you bought Version 2 in 2012 to use on a Mac, you were ripped off by Rosetta Stone. Join the crowd.Windows users should not be too smug about the situation, as the end of Version 2 support means your product will have all sorts of issues too, unless you downgrade to WinXP.Version 3 does run on current platforms, and is at least somewhat supported (to the extent Rosetta Stone supports any product). Version 3 is easily the pinnacle of Rosetta Stone software. Given so many users prefer version 3 to version 4 though, don't be surprised if they pull a Microsoft and force you to their new product nobody wants.Total 4e, is a retrograde of Rosetta Stone. To be fair, if you are always connected -- literally 100% of the time, never a lost packet -- and live your life via social media, Total 4e might be effective. Don't expect to use the highly touted iOS apps on your iPhone or iPad though unless you are connected 100% of the time with those devices also. The whole idea of quickly practicing while in line or waiting in an office...yeah, that doesn't conform to the Rosetta Stone licensing model.Speaking of which, Rosetta Stone now has two components and two licensing models. There is the software application and the online social media part. The application can be run as long as they support it on current platforms. The online social media component is now on a subscription basis. You pay for every month in which you want to participate. You can still use the app on your computer, but you just paid a premium for online access you aren't using unless you continue to pay the subscription.Given there are many free or lower cost websites where learners can interact and practice language skills, why pay Rosetta Stone a monthly premium for less content? Therein lies the reason so many people look at Total 4e and then try to find version 3 before supplies run out.How about another suggestion?Try L-Lingo. L-Lingo uses a very similar learning model to Rosetta Stone. The interface actually has more features than Rosetta Stone and you can customize the interface to use Roman phonetics or native script. They have iPad and iPhone/IPod Touch iOS apps which you can use on a plane, or anywhere else, with or without Internet access. Best of all, all of their programs together (Win or Mac desktop, iPad, iPhone/iPod Touch) are less than half the cost of Rosetta Stone Level I.L-Lingo specializes in Asian languages. They are probably a superior option to Rosetta Stone Total 4e for most users. L-Lingo offers a free trial for their desktop application, and also for their iOS applicastions for some languages.There are other good options listed above, particularly Fluenz and Pimsleur which use different methods. Be sure to check them out before buying anything published by Rosetta Stone.", "overall": "-"}
{"reviewText": "I did level 1 of Filipino and I thought it was basically worthless.Maybe you have to complete all levels to be able to use something but level 1 will teach you nothing usuable.What's amazing to me is how much money Rosetta Stone charges people for this software.Buy Berlitz products. They are a lot cheaper and more useful.", "overall": "-"}
{"reviewText": "I bought this software to learn mandarin and installed it on my desk top, and now it would not allow me to install it on my laptop. This software is for only one-time use.  It does not say anywhere on the box or the directions that you can install it only on one computer. I paid full price for this. The online support told me that if I want it on my lap top I must pay full price for another copy. Very disappointing. Most software allow three installs in case the computers crash happens or what not. I find this to be ridiculous. I do not recommend it. If you want to learn Chinese, there are many online tutors cheaper and live then to pay for another copy of this software.", "overall": "-"}
{"reviewText": "The theory that people can learn a language as adults in the same way that we learned it as a child is laughable. Children do not have the perceptions, presuppositions and logic centers that an adult has and will use to try and figure out what it meant by the pictures.All RS does is show you pictures and say something, you have to guess what is being talked about. Is it the boy? The Table? The grass? Something about the Boy? His hair? Something about his hair? You have no idea what the audio is talking about. You eventually figure out which picture is meant, but you have no idea why in most cases.From there, the difficulty and length of sentences increases exponentially till you are listening to paragraphs about your choices. Epic Fail as they say. Let us also keep in mind that it takes a child nearly two years to begin to speak....like a two year old. Does this sound like a good investment of your time?If the program worked as well as they say it does, they would not have to spend so much on marketing in places like Sky Mall. Pimsleur doesn't act this way, why? Because they have the best approach of any language course out there. If you want to actually be able to speak the language you are learning, get Pimsleur.", "overall": "-"}
{"reviewText": "I bought this product a little over a year ago. Now that I am done with it, I wanted to sell it. I put it on eBay and Craigslist. They had their lawyers contact the sites and have them remove the listing.Apparently in the tiny 4-point font disclaimers on the package it says that the license is not transferable, so you can't sell it as a used item after you're done with it.Total crap !", "overall": "-"}
{"reviewText": "I have spent 4 hours with support and am still not operational. I think they need to train their support people or just say they don't offer any support. It is the worst support I have experienced in 15 years of using computer software.", "overall": "-"}
{"reviewText": "This may be a way to learn a language? The user interface is inscrutably crummy. No pause button, no settings menu when you are into a lesson. The lesson template is OK once learned. No guidance on how to use the template. You are expected to know when to click or speak.They have so many fancy monikers for &#34;features&#34;.......I only wanted to learn the French language; not the Rosetta stone language.And it expires after 3 months.Worst setup of any program I've worked with in the last decade. And i write code. They give you 2 CDs and then send you to an online site.This teaching method is like trying to teach typing via the hunt and peck methodThere are many many free and less troublesome ways to get language capability.", "overall": "-"}
{"reviewText": "Understand that if you purchase this product, your ability to use all the features has a 6 month time limit.  If you install and do not use the product promptly you will be told that half of the product will not work unless you pay $100+ for a subscription.  It does not matter if you have not used the online services at all, the money is gone, the service is gone, and you must pay more to use all of your product.  Customer service on this regard is not helpful at all.  Complete waste of money.Steer Clear.", "overall": "-"}
{"reviewText": "I got so frustrated after just 20 minutes with this program. There is no structure, no teaching of verbs and tenses. You are just listening and repeating phrases. Might be useful if I wanted to just have a mangled understanding of the language so I can order a croissant during a short trip to Paris, but not something that will help me develop a strong foundation of a new language.", "overall": "-"}
{"reviewText": "I have purchased Spanish 1-5 and French 1, both software sets continually have the 2123 and 2125 errors.Although there is a 15 minute walk around of the errors, it is aggrevating to work around this glitch 15 minutes everyday before use.The support line is great, they are patient and will spend 2 hours on the phone to correct this error. BUT to only have the error return the next day.GREAT SOFTWARE WHEN IT WORKS!I will not purchase Rosetta Stone again because of this glitch.$1000 mistake.", "overall": "-"}
{"reviewText": "After working with this software for months, I still could not put a single sentence together. After doing a lot of research, I tried another program and after just a few weeks I actually had a conversation with a friend (basic french of course).  What a waste of money Rosetta is.  Do your research folks.", "overall": "-"}
{"reviewText": "I got this as a gift, and I knew it would not work for me, which is why I didn't buy it for myself. I like to understand the fundamentals of the way a language works before I just start memorizing words by looking at pictures, and Rosetta Stone doesn't teach you anything about that. You just have to figure it out. I understand the whole concept of immersion, but you need some kind of background on grammar. Five minutes about grammar at the beginning of every new chapter would solve that problem. There are rules that are very basic, like if something ends in A, in Spanish, it's probably feminine. If it ends in O, it's usually, but not always masculine. Regular verbs are conjugated the same way. I love, you love, we love. He is, she is, they are, we are, etc. But Rosetta Stone doesn't teach you anything about the language. They just keep showing you pictures of people doing stuff or eating stuff, and hope that you catch on. I took 4 years of Spanish, and have become more fluent by speaking it. But i also know the rules of the language, so I can read things I haven't seen before. I practiced French and German from cd's  and from books. I learned more from listening to cd's in my car than than Rosetta Stone. There is something to be said for teaching someone how to at least conjugate basic verbs, or explain the differences in gender in nouns. Rosetta Stone is like a video game where you just click on answers, but they don't explain why the answers are wrong or right. You can use common sense to get through the levels without learning much about the language. Then, they give you spelling tests without explaining the special characters. I can't just memorize accent marks because they popped up on the screen. Tell me when accent marks are used in general, so that I can understand when to use them. I don't know how you would ever learn to write in French, because they don't teach you how. They don't explain how to pronounce things, and French has a lot of extra syllables that are silent. They need to explain when, and why, they are silent. They expect you to copy what the people on the recording do. But, copying isn't learning a language. I already had a background in French before i got this, and I was still confused.", "overall": "-"}
{"reviewText": "My disks were defective and would not work in any outlet. The commercials on TV also had given the impression you could work the disks in your car and be speaking a new language after using the disks on a long trip. I don't see how this could be possible and use the computer as well.", "overall": "-"}
{"reviewText": "Only has limited use on the apps i bought this for.  After six-months a subscription is required.  Also, nothing that special about the Rosetta Stone method.", "overall": "-"}
{"reviewText": "I didn't stick with it very long.I did  learn a little French.I would like to go back to it later.", "overall": "-"}
{"reviewText": "I was under the impression that I was receiving the onesie and the jersey shown in this listing especially when it says soccer outfit.  Only getting the onesie makes this a horrible deal.", "overall": "-"}
{"reviewText": "I bought this onesie as my son's Halloween costume.  I went as a soccer player and he was my soccer ball.  (Don't worry, I carried him in my arms and never put him on the ground in case anyone thought he was a real ball.)  The onesie is adorable, but it was definitely too pricey for what it is.  I would not buy another one of these onesies unless they brought the price down, significantly.", "overall": "-"}
{"reviewText": "My husband bought me this for my birthday.  I used this for months, as I had German friends traveling to the US and wanted to be able to offer conversation in their native language.  This software fell short (by a long shot).  The pictures work well, but at times can be confusing.  Often, no matter how I spoke a phrase, it would tell me I'm incorrect, conversely, at times when I've been horribly off, I've gotten credit.  The software is easy to use, and reliable, but even receiving a response from their team is like pulling teeth. I had contacted them numerous times for explanations (there's no key or anything textual for me to use as reference other than an alphabet references, just pictures...and figuring those out can be a difficult task as well) and was given very generic responses that led me nowhere.  As the lessons went on, the language became more confusing.  There were articles and demonstratives that were extremely confusing, and I couldn't figure out if they were based on the object or gender/plurality of those speaking (nominative, etc).  I received no verification from Rosetta, simply referring to the dictionary reference, which was of no help. I even attended an online Q&A, which they glossed over my question without an answer! They quickly read it and basically, nonchalantly, referred back to the above, unhelpful reference I was given before. Given the amount you pay for this software, they should provide other pertinent lessons on what I've mentioned (it's an entire topic that could be lent to itself). I was constantly bombarded with emails and pop-ups trying to get me to buy more support or more software, yet I couldn't get anyone to answer my questions and often had to use Google Translate or a plain search on the internet. I think German is quite difficult for a native English speaker to grasp with just this software.  I would recommend this if you have a basic knowledge of a particular language, as it's good for brushing up.  But, for me (and for German), I would not recommend Rosetta Stone. It was much more helpful to do YouTube searches and speak to my German friend over Skype (though frustrating).", "overall": "-"}
{"reviewText": "My family purchased Rosetta Stone German 1 for me and I must say it is a complete disappointment because I am unable to get past the microphone set-up screen.  We tried the info in the \"help\" section which did not help at all.  We have contacted Rosetta Stone with no response.  Keep in mind that after 3 months the online portion goes away unless you pay another fee.  Can't understand why it it so difficult to even get started.  (I also have Pimsleur which is much simpler, so looks like that is how I will be learning German).", "overall": "-"}
{"reviewText": "Unfortunately, I'm not actually able to rate the software itself because it never ran on my Windows 8.1 PC - producing the Fatal Application Error #1141.  All available fix options suggested on the Rossetta support site have been tried without success.  Writing support, it was suggested that I remove my antivirus and anti-malware software.  Even if that were to be successful, it would still be an unacceptable `solution' since it would be useless and dangerous to run the PC without them -- just so I could run Rosetta software.  The internet has many, many people making the same complaint -- and many of them are using protection software other than what I'm using (Zone Alarm and MalWarebytes) .  I even tried it on two different PC's.  The second PC runs windows 7.0.  The same result occurred.If it works for you, that's great.  It doesn't for me.", "overall": "-"}
{"reviewText": "I bought this for my wife. Our computer is about 6 years old, WIN XP, SP3. I've tried to get it loaded, but it wouldn't load. So I uninstalled it. I tried again. Same result. I decided not to waste my time with it anymore. I am handicapped, and it takes me a long time to type, too long for a chat-type service. Maybe Geeek squad can help.", "overall": "-"}
{"reviewText": "Open the box and did the install and nothing worked. The language CD would not load. That killed the evening I had set aside for the beginning lesson. I took it to work the next day and spent 2 hours trying to get it to load and the Tech Support people had to work for an 1/2 hour on the phone just to get the thing to begin working. Huge pain,,,,,,Loss of time,,,,,,,,,ruined my attitude about buying any follow up lessons.", "overall": "-"}
{"reviewText": "I do not have the rest of my life to guess at how you use the phrases. I hate that I ordered the whole program...however they do worry you to death trying to sell you other things.", "overall": "-"}
{"reviewText": "I have given this one star, not because I hate it, but as a rating in comparison to Total Greek.  If you get Rosetta Stone you will need to use a Greek Dictionary and have a tutor to help you interpret what is going on.  If you just wing it without, you will never really understand what you are doing.  You have photo's and sentences and words, but there is no explanation as to what Rosetta Stone is doing or why.  In my humble opinion, it would not be too difficult to make a better product than Rosetta Stone.  All you would need to do is offer some explanations as well as use a different format in some cases.  An advantage is found in the use of the text to speech verification.  However, as for the photos, it is a nifty idea, but the TV is a better visual medium then this, and it is no help at all. So photos alone are not the answer, although it is good idea.  Rosetta Stone also has various glitches.  For example, there will be a sentence, and you have to match it with a photo.  After you get the answer correct there is no way to *easily* check to see what was said in writing without going back where all the sentences are flashed off in the beginning.  They also use the same format for every language, I really question how committed they are to teaching the best way for each language.  I hear they throw in TV and other such things in Latin.There is a WIDE MARGIN for improvements here, so keep your eyes open for the next product, I know I will.  In the mean time get some Greek friends and purchase  Total Greek.  When you finished THEN I would say you can go back to Rosetta Stone.  For example to do it the other way around would be such a waste of time I cannot even make a compassion.", "overall": "-"}
{"reviewText": "waste of money. The software dosen't have a good ground up approach, no alphabet exercises. This software would help maybe if you are looking for more conversation practice, but it's still not work the price of it.bottom line, software is out of date and way over priced", "overall": "-"}
{"reviewText": "We are studying Hindi with the Pimsleur method. Because Pimsleur does not use writing in the earlier lessons, (that is a good decision for languages that use our alphabet because we need to learn the sounds and not pronounce the letters as they are in our language.) But, Hindi used a completely different set of characters that are very important to the speaker. So, we learn the pronunciation and sounds, and Rosetta Stone for the other needed parts.We have also used Pimsleur for German and Russian and there have no need for Rosetta Stone.We were using this program to work with the script. It was version 4, which Rosetta Stone says can be put on two computers for five students in a family. That is not true. Because of my eyesight I needed to use a larger screen so I tried to put it on a second computer. It would not activate. I had to delete it from the laptop it was on before I could change it.When I deleted it from the laptop it gave me a set of two numbers, one was the Activation Key, which I already had, and another was the delete number. You had to send both Rosetta Stone before you could activate the program on the exchange computer. Due to a glitch, (in the computer world - one that I have been in since 1979 - glitches happen) and I lost the delete number. I tried to contact Rosetta Stone and work things out so that I could use the program on my larger screen.EDIT: The product now works on both computers. They must have straightened it out in house, but they did not communicate this with me, so I found out by accident. Rosetta Stone is a viable help to Pimsleur since it does have pictures with the words and helps one to visualize certain things. They also help with the Hindi phonetic system and, since that is so different than the Western Alphabet, the help is appreciated. The product is fine, a bit overpriced, but a viable addition to Pimsleur for Hindi. I would not need it for something like German. I can give it two stars now. I would give it three but for the lack of communication with their customers.", "overall": "-"}
{"reviewText": "This teaching tool left a lot to be desired for me.  For the price, it should have included a book of words and phrases to assist in learning process. It was too structured to be of any assistance in what I felt I needed.  In my plans to visist Italy, I needed to learn words that would assist me in traveling, shopping, going into eating establishments, and simple needs.I was so excited to receive the Rosetta Stone package and get started on the process, but was so disappointed in the program.  I did not want to do group sessions or learn to spell and write Italian. I wasn't moving there.  I just needed to learn as many useable words as I could for my trip.", "overall": "-"}
{"reviewText": "Got this software for Christmas, after a month of emailing back and forth they finally told me it is not compatible with some CD drives and that I must make a copy of it on a separate computer to a thumb drive to install it. For $180 bucks you would expect better customer service and a well-vetted install.. or maybe some online install. If you have a mac, be prepared for a headahce.", "overall": "-"}
{"reviewText": "i have found it to be extremely repetitive and is not helpful in learning basic conversational italian. i would differently not recommend it.", "overall": "-"}
{"reviewText": "How does any foreign language CD teach its language by merely repeating its words without translating those words into English?  Now I can pronounce those words but I have no idea what I am saying!  What a concept and I am out over $100.00!", "overall": "-"}
{"reviewText": "Do not buy this product from Amazon. Once opened, you are stuck with it. I have tried for several days to install this product on two different computers all with the tech support of Rosetta Stone. We cannot get it to install correctly. I have no idea how good the product is. I can say tech support seems to have done everything they could. They have even sent replacement disks. If I had bought it directly from Rosetta Stone, I would and could return it, but from Amazon, I cannot.", "overall": "-"}
{"reviewText": "All seemed to go well until I got to the first lesson. I spent three days trying to get to it. The instructions said to &#34;click on the green arrow&#34;. Simple enough except all it did was bring to the a slew of boxes that gave choices from lessons to games, however clicking on the green arrown DID NOT bring me to lesson number one. All it did was keep sending the same choice boxes with god awful music in the back ground. So, Amazon was good enough to accept its return and refund my money.", "overall": "-"}
{"reviewText": "Trying to install this on Mac OS X 10.6.5 fails. A 30-minute live chat with tech support (in India, naturally) resulted in them trying to give me instructions for a PC, leading nowhere. The tech had no idea what to suggest, was not familiar with the error messages I was getting. I then submitted a claim ticket to technical support via email detailing the problem (giving them the entire installation log), and after 4 days I have yet to receive a response of any kind. So, this is a review of the lack of support and customer service, and the defective installation aspect of the software, not its language instruction. It is hard to believe that one can pay this much for software that cannot even install itself, but apparently Rosetta has accomplished this. A brief tour around the Web suggests my experience is not unique. I cannot recommend this for Mac users.", "overall": "-"}
{"reviewText": "It's great until you upgrade your computer and need thier support...What is there not to love with this product; every aspect of the interface is great, until you get a computer virus and you need to install it on another machine.  Called into customer support, \"Sorry can't help you, you'll need customer support not techncial support.\"  Wait, this is the customer support number, what is wrong with this picture?  Call next day, \"Yeah, you'll need the proof of purchase from 4 years ago to re-activate.  Let us know when you find that.\"  If a software product requires re-activation, it should allow de-activiation of prior installs, like iTunes.  Now I have over $300 worth of useless CD's sitting in my desk drawer, compliments of RosettaStone.  BuyInstant Immersion Italian Levels 1,2 & 3or Fluenz and never have to worry about someone else's support problems.Get with the 21st century RosettaStone.", "overall": "-"}
{"reviewText": "Not a good program. Gets old very fast. No explanation of new words. Not engaging. Very expensive for what you get. I think most of the 5 star ratings are from paid reviewers because I just don't see what they see in the product.", "overall": "-"}
{"reviewText": "I've tried Rosetta Stone once before, and was not impressed by it. I tried this product, and again found it also to not be a very effective tool at teaching a foreign language.I've tried a number of software products for foreign languages, and what I've found to be most useful is really something most similar to a standard classroom lecture. I can't learn from the Rosetta Stone method, and found that my retention after a day was pretty much close to zero.", "overall": "-"}
{"reviewText": "I called Rosetta Stone & inquired whether or not this particular version FINALLY had 2 KEY components, which have inhibited my buying their product over the years. The 2 components are a grammar/structure aspect & also a dictionary. My inquiry was met with a brash \"No, it does not & Rosetta Stone will never incorporate those features.\"Firstly, let me assure you I'm well-aware of the superiority of the immersion technique, as the primary means of teaching, & am therefore not stating Rosetta Stone should deviate from this methodology of teaching language(s). All I AM stating is that these 2 components would complement & facilitate the process!The representative kept parroting the same, \"Our language system is #1 in the world & by & large everyone loves & bla bla bla...\" He went on to state that \"If you complete all 5 Levels, then you have mastered the language & that there'd be NO need for a dictionary.\" Yes, you read that correctly!!! So I asked the guy, \"Is every word in any given language's dictionary contained within the 5 Levels of the course?\" He said, \"No, but it wouldn't need to be.\" What an ignorantly-indoctrinated imbecilic answer!!!So I improvised a real-world example, whereby a dictionary would be useful. I asked, \"What if, upon mastering all 5 Levels, I saw something interesting on the news about Italy & wanted to call my aunt in Italy & say, 'Aunt Mary, I just saw a segment on the local news about Naples.\" Okay, now what if the word SEGMENT was not contained within those 5 Levels or even if it was, but I'd forgotten how to say it? A Dictionary would OBVIOUSLY be needed!!! His response was, \"You could go online & talk to one of our Language Tutors.\" Of course I replied, \"What if I just want to get the bloody word?!?\" Again, he reiterated \"Rosetta Stone will never incorporate those features in its program.\"His final words were, \"I don't understand where you're going with this. Would you like to purchase 1 or more levels of the Italian program?\" My final words (while laughing) were, \"No, because it doesn't have a dictionary & you're too blind &/or stubborn to admit it's lacking one.\"", "overall": "-"}
{"reviewText": "Disappointed - Not as intuitive as I expected.  Learning style doesn't work for me.  Might try and find someone else that loves the product and try again using their study sessions as a guide...", "overall": "-"}
{"reviewText": "After months of struggling with Rosetta Stone and learning next to nothing I picked up a Pimsleur Japanese course and in half an hour I had learned more and retained more than in all the months of using Rosetta Stone. I am an auditory learner, not a visual learner so Rosetta Stone was useless for me. I will stick with Pimsleur all the way, I have learned more in just a few half hour sessions than I ever dreamed possible. Too bad both programs are ridiculously expensive, I don't think either program is worth the price. Rosetta stone is worthless and I would only consider paying for a used copy of Pimsleur because a new one costs ten times what I would pay to learn the language. The price for both is about the same. A great program that is worth the price is Human Japanese, it is more structured than the other two and gives you a better grasp of the grammar than either of the others as well. Personally I use both Pimsleur and Human Japanese, Rosetta Stone is overpriced garbage.", "overall": "-"}
{"reviewText": "Rosetta Stone's Japanese software can only really be used in conjunction with other Japanese learning resources. In my experience, it is good for practice if you already know the material being covered. Learning from it as a sole resource is unreasonable. They simply don't spend enough time drilling vocabulary and there is pretty much no grammar being taught.Problem with Rosetta Stone is that they don't explicitly tell you anything in your native language.  Instead, they expect you to infer meanings and make your own connections. The problem with this is that the user will probably end up making the incorrect associations without a parent or teacher to correct them.  Many of the pictures (from which you are expected to derive fairly complex concepts at times) are overly ambiguous.  However, if you already know the language, the pictures can make sense... most of the time.If you are already studying Japanese and you simply need something to help you with listening comprehension, then that is pretty much all this is good for... and really, it isn't great for that.  For the price, you are much better off looking elsewhere.  The websites iKnow.jp, TextFugu.com, and Skritter.com come to mind.  You'll end up getting set back about the same amount of $$ as buying just Level 1 of Rosetta Stone Japanese, but the amount of content you receive is far greater and of a much higher quality.  If you are not interested in online study materials, the Pimsleur Japanese audio series is far superior to Rosetta Stone and also available right here on Amazon.com", "overall": "-"}
{"reviewText": "Rosetta Stone software is garbage.  Maybe it is very sophisticated or something... I can't get it to load on my computer.  The chat live service couldn't get it to work either.  For $250.00 I expect to get a great program that loads and i can start learning right away.  I wasted a whole day trying to get it to work.  For the price you should get all the printed materials with it, but... you don't.  Rosetta Stone should be run out of business.  I will never, NEVER buy another product from them and i will try to tell as many people as I can not buy one either.", "overall": "-"}
{"reviewText": "We were happy to receive rosetta in time for Christmas. My son wash`t able to get this up and going to learn.  He called the company and still wash`t able to install it.  The rep said other customers were also having problems.  Very disappointing.  It was to be the present he really wanted", "overall": "-"}
{"reviewText": "I might recommend to all of you an alternative..I learned how to read Korean in less than an hour and am learning Korean very quickly here are the sites..they are 100% free and work hundred times better than this expensive things. here are the sites for you the first is [...] and the 2nd site is [...] These sites are amazing and you can even interact with the teachers. They even have an online bookstore where you can find extremely affordable books and cds I am purchasing them already. Hope you enjoy the sites!", "overall": "-"}
{"reviewText": "This program is a waste of time and money.  After paying for this overpriced software package, a few months later they hit you with more charges to maintain your account. The program does nothing more than show you pictures and then says the words in Korean.  They never bother to teach anything or give you a way to learn what they are saying except by the picture. Most of the time the picture is confusing and doesn't help explain what your supposed to be learning. I regret making this purchase, wish I could get a refund.", "overall": "-"}
{"reviewText": "I bought this program to help prepare myself to teach English in South Korea. As a linguist and ESL teacher, I know the limitations of such programs, compared to taking a course or making friends with a speaker of the other language.The best use of Rosetta Stone is for visual learners to pick up basic vocabulary. Even if there were a RS 2 or 3 for Korean, which there isn't, it still wouldn't help you much beyond that. A picture dictionary provides the same benefit, though. It would have far more words than RS does, for $90 cheaper, and it'd be easier to carry around. Plus you could add related words in the margins! Get one with a CD, so you can mimic the pronunciation.The language quality for Rosetta Stone products is hit or miss. For languages such as Spanish or French, the language is perfect. For Korean or Hindi, though, RS products stink. They're full of language errors! Language learners won't know that they're learning bad Arabic or Korean, until they finally make a friend from that culture. By that time, they don't need RS anymore. You'd think their quality control would be much better.There's also an issue with poor service. Years ago, I misplaced my disk 1. This was years ago. RS wants to charge me an exorbitant amount to replace that disk, even though I still have disk 2, so obviously I'm not trying to scam them. So I deducted a star for poor service.My advice for LL is:1. Get a picture dictionary with a CD.2. Stay motivated! Study regularly! Use what you know! Get lots of rest!3. Take good language courses with real instructors who care about you.4. Find ways to make friends with people who speak that language. You might do a language exchange, and teach each other your mother tongues!Blessings.", "overall": "-"}
{"reviewText": "I bought this product or an earlier version of it some time ago.  It was sold with a guarantee, but when I wrote to get my money back, I never got an answer.Why did I want my money back?  Well, I was not learning Korean with it despite hundreds of hours with it [I only stuck with it because I had spent so much money and knew of no available alternative at that time].  The pictures were ambiguous and in a few classes unclear [I am not used to seeing a horse's head up so close that I can't recognize it. There is a picture showing a leg and a foot -- which one is meant?  What is being said with the guy falling off in the rodeo or the guy on the skateboard?].  It took me a long time to figure out the prepositions of place without any explanation.The program also doesn't allow for the fact that there are not one-to-one mappings from \"observation\" to a target language for  all prepositions of place [think of the diverse uses of the English preposition of place \"on\"]. In Korean, the words for red and blue have a contrasting initial consonant, that I cannot hear in the program, but the second consonant, though written the same, sounds distinctly different to me.  Maybe these are allophones, maybe not:  But RS is no help here.I worked HARD on this program.  It was one of the most frustrating experiences in my life.  In fact, I got to the point where I knew all the answers but still had no idea what I was saying in 10~20% of them.  The review system seemed faulty:  I would be tested again and again on words and phrases I already knew and got correct -- and not get out of the loop.  This is NOT how I learned my first language.  [Besides that, as an adult, I don't expect, and research does not indicate, that I will learn L1 and L2.]  Here are two places where some guidance would have been helpful:1] Korean has two systems for counting, pure Korean and Sino-Korean.  There are specific applications for each, e.g., for how much something costs versus how things are being bought.  RS teaches one set of numbers, but then times are taught, with-out any explanation that the numbers just learned are simply a different system than what applies to the hours of the day.  2] Korean only uses plural markers and subjects when they are not clear from the context.  But RS seems to be ignorant of this, very early on make a big to-do [as I would if I were teaching English, German or Spanish, for example] of the difference between 'banana' and 'bananas.'  This certainly did not help me when I got to Korea and tried to buy things!The speakers speak rapidly.  This is a natural speed for Seoul natives.  But some allowance should be made for 1] learners and 2] the reality that people in some parts of Korea speak much more slowly.Even  more of the content is questionable: A Korean friend said that the sentences were unrealistic.", "overall": "-"}
{"reviewText": "I'm writing this because this is a waste of money, you won't learn as much as you could. Best way I can describe it, is that it's much like as if you were to learn Farsi in school with a bad teacher. You'll find yourself not knowing what you're saying, and confused. If you actually want to learn Farsi, buy Pimsleur, you'll actually learn the language and for a much cheaper cost. Also, worst thing is, you can't return the product, so you will be out 170$. Don't make the same mistake I did!", "overall": "-"}
{"reviewText": "This course may be fun for some, with lots of things to do. But if you are looking for something that will help you interact in the country, you may find out this won't take you far. Perhaps you'll need to buy all the levels for that, but at their price you may end up bankrupt!!", "overall": "-"}
{"reviewText": "I completed rosette stone portuguese (theres only 3 levels instead of 5), I was shocked at how little portuguese I knew.  I dropped a couple hundred bucks on this product.There are far better alternatives.1.  babbel.com  &lt;&lt; 10 bucks a month, PLUS a review manager that gives you the words you dont know more often and the words  you do know less often.  Rossetta stone is linear, it doesnt learn what you dont know.2.  pimsleur  &lt;&lt; this is GREAT for getting up to speed on speaking only. (no reading or writing).I wouldnt say rosetta stone is useless, it does teach you some, but its pretty close.  Its all marketing, far better products out there dont waste your time please.", "overall": "-"}
{"reviewText": "I would like to be able to review this product in more detail, but I can't since I have yet to be able to activate the online services. The activation code doesn't work because it keeps telling me that I don't have internet access.  Obviously I do have internet access or I couldn't write this review.  I have contacted customer service and they have been zero help. I have also asked to have this escalated to a manager but the woman I've been working with refuses. It's been over a month and I can't get anyone to actually help me.", "overall": "-"}
{"reviewText": "I got this for my 17 year old son for Christmas, and after multiple attempts he was unable to make it work on his computer.  He discovered this is a common problem with this software.  He contacted customer support, but it still wouldn't work.  Unfortunately, I wasn't aware of the problem until it was too late to return it.  Overall it was not a good transaction, and we're not happy with the product.", "overall": "-"}
{"reviewText": "I am heading to Russia on a mission trip soon and purchased this product. It is totally useless. It in no way prepares you for the short term that one would be in another country. The basics do not exist. I don't want to read Russian, I do not want to conjugate verbs in Russian, I just want the basics that one would need like hello, good bye, please to meet you, where's the bathroom?....you get the point. If you are looking for the basics DO NOT buy this. iPhone apps are far better and they are free. If you want to speak Russian and read russian and write Russian, go for it. Just know I have a useless piece of software sitting around.", "overall": "-"}
{"reviewText": "Buyer Beware!  I purchased a Russian language Rosetta Stone for my son who traveled to Russia last summer.  He ended up using the program almost not at all, so it's basically brand new.  We just listed it on Ebay, because it is no longer of any use to us.  We were notified by EBay that it's a copyright violation to sell any Rosetta Stone products.  (Apparently it's in the small print when you load the program onto your computer.)So, if you think you will buy it and try it or use it for a trip and sell it when you're finished, think again.  It's yours and you will not be able to recoup your money.", "overall": "-"}
{"reviewText": "This is not the best approach for learning Spanish.", "overall": "-"}
{"reviewText": "I'm a linguist by training, with a focus in how people learn languages.  The concept behind Rosetta Stone is based on the observation that children can induce the grammar of their mother tongue from examples in which the specific functions of linguistic units are contrasted.  As Rosetta Stone would have it, since children learn effortlessly this way, then why not adults?The problem is that children require millions of impressions to induce the grammar.  Also, when mature humans learn a second language, the syntax of the first language interferes with the notions one constructs of the second.  It's therefore highly inefficient to teach language this way.  With adults it's actually much more efficient to be more explicit about the grammar of the target language -- to provide clear descriptions of the rules accompanied by many examples and much practice.  Immersion can be very useful, but not to the exclusion of explicit instruction in the rules of the language.  I found myself playing a tortured game of 'find waldo', trying to figure out, say, is X the feminine form of some plural article?  One ends up learning a few wooden formulae, but not learning the structure of the language.Aside from this, I found the software implementation to be very weak.  The whole activation mechanism is painful.  If you switch computers or re-install the OS on a machine, you have to go through a tortured process with Rosetta Stone support to obtain a working activation code.  Versions 3 and 4 failed to co-exist on my Win7 x64 system.  When I tried to use V3, an installer was kicked off which quickly failed, after which neither Version 3 nor 4 worked, and I had to reinstall both -- which required the laborious process of obtaining new activation codes (for some reason).  Oh, and forget refunds, if you purchase from Amazon, none are given, even if the software stops working on your machine.The software itself seems to be written using some cross-platform tool that reminds me of Macromedia Director -- hell, it may be just that.  It's laggy, the fonts are ugly, the images are full of artifacts, the UI looks like it was designed by a software intern with no design experience.  The tool to judge pronunciation is horribly insensitive in Version 3 (I speak other Romance languages, so I can tell), and in Version 4 they adjusted to customer complaints by making it far more tolerant, so now it's a joke -- one can score green even with comically distorted renditions of the cues.Here is a complaint letter written by a developer to the CEO of Rosetta: [...]Overall, I suggest steering away from this product.", "overall": "-"}
{"reviewText": "We bought this product 5 years ago prior to a trip to Stockholm. It is Version 2; I think they are now on Version 3. Started it and basically learned to say, \"A boy in a boat.\" Got very busy with family matters and put it aside for the time, thinking I could go back to it at any time. My computer crashed and I got a new one. Finally got time and am planning a trip to Stockholm again. Got it out tried to install with no luck. Called support. Apparently my version is no longer supported. So got sent to another operator, who was very nice, but was limited in what she could offer to help me. Was informed that I could upgrade to the current version for $49.99. I was very disappointed that I could not use the program for which I had already paid a fairly substantial price. How much would it cost the company to help me install my current software or send me a new disk? Be aware that you might not be able to re-install your software in the future.", "overall": "-"}
{"reviewText": "Expensive and very boring!  I could not motivate myself to learn with this method!  There must be a better way!!", "overall": "-"}
{"reviewText": "Let me preface this by saying I speak five different languages, English is my native tongue but I also speak French, German, Latin and Mandarin.  I am very well familiar with pronounciation of vowels and dipthongs not normally found in my native tongue.That having been said, I find the Rosetta Stone software's ability to rate my speech as extremely poor.  It often refuses to recognize my voice pronouncing words (and even single syllables).  Moreover, when I repeat a word or phrase into the microphone, it often does not recognize that I have stopped speaking, and the software simply sits there doing nothing. If it were human it would be wearing an idiot's grin.  I am not exaggerating when I say that I repeat a one-syllable word and the program sometimes takes up to 20 seconds to acknowledge it (whether I pronounced the word correctly or not is immaterial). Note that I am using a state-of-the-art PC, so hardware isn't the issue.Furthermore, the Rosetta Stone \"immersion\" approach to language learning is not good for anyone who has learned a second or third language through formal lessons.  The software is designed to NOT take your native tongue into account, but the only benefit of that is to Rosetta Stone, NOT the learner.  Many languages have sets of rules regarding gender agreement or unorthodox pronounciation; most languages have regular rules about conjugation.  RS imparts NONE of these rules; doing so would require an explanation in every native tongue.  Instead, you are left to figure it out on your own. This seriously impedes the process.  What this product will do is teach you to speak BAD Swedish.In short, if this is your first attempt at learning a non-native language, it might work for you.  But if you have any experience in multiple languages, RS will likely leave you feeling frustrated.", "overall": "-"}
{"reviewText": "I am Turkish. My American husband bought Rosetta Stone and tried quite a few times and it simply didn't work. Like other reviewers, he can say \"girl on top of horse\" , \"boy under the ball\" etc but it never helps to put it together to talk. When I read Rosetta Stone's reply to another reviewer here, it made me think that it was full of buzzwords that doesn't explain why it seems it doesn't work for anybody so far. Later, my brother-in-law, who was very interested in learning Turkish, also got this course and I don't see that it helps him either.There is a distance learning system from Ankara Univeristy - TOMER , the organization is equivalent to Goethe Institute or Alliance Francaise, as it is used by people who came to study in Turkish Universities. My husband didn't use this program but I had university friends from Madagaskar and Kenya who could follow classes in Turkish after attending this school in Ankara for one year. Now it seems they have a computer-based distance learning course and the price is not that much.[...] The site does require Internet explorer.We will also check Pimsleur Turkish method as I liked their system when I found a Japanese Pimsleur set and am pleased with it.Hope this helps.", "overall": "-"}
{"reviewText": "First, they are very expensive. I went to Turkish public school for 2 years. Got this as a review. I was able to go through it in 40 minutes. But I can not see how anybody that does not speak Turkish be able to learn Turkish from this. NOT POSSIBLE! It is IMPOSSIBLE! Don't believe the advertisements. Don't waste your time or money.", "overall": "-"}
{"reviewText": "Simply put: it doesn't work. Rosetta Stone claims to design their software based on the idea that you can learn a second language the way you learned your first one, through so-called immersion. First of all, using Rosetta Stone hardly qualifies as immersion. Secondly, anyone who has studied second language acquisition knows that adults do not and should not learn language as if they were children. It may sound easy because most of us don't remember much about learning our first language, but if you think about it from a common-sense perspective you will realize that even a ten-year old native speaking child still makes many errors. Do you want to spend ten years trying to learn a second language? Second language acquisition programs should take into account the fact that adults have many more language and cognitive skills that they can employ in their language study than children do. A well-developed program would account for this and use this to the learner's advantage. Rosetta Stone does not do this.From a motivational standpoint it is also a very discouraging program. As others have said, it doesn't teach you how to communicate. Pimsleur's audio programs, while still limited in some ways, have the advantage of teaching you language that allows for immediate conversation (or immediate conversation with people you don't know well.) I found it very encouraging that I was able to use the Turkish I learned in my first lesson to strike up a conversation with a Turkish man I met at an international dinner at my university. All I did was asking him if he was a Turk and respond that no, I am American when he asked me if I was Turkish. (You can imagine how please I was to be asked.) But with Rosetta Stone you won't be able to do this. You'll be able to say hello and then point to the people at another table and make the astute observation that they are eating a meal.It is unfortunate that the program is not more useful because resources for Turkish study are quite limited. But until Rosetta Stone learns to incorporate some conversational skills and sound SLA theory into their programs I would suggest avoiding them unless you have money to burn.", "overall": "-"}
{"reviewText": "I was so happy to see a review from someone else who struggled with this software!! My fiance is Turkish and I spent HOURS painstakingly using Rosetta Stone, only to be able to say random nouns and sentences like \"The boy is in the plane\" or \"The girl is under the table\". The only way I even grasped that much was thanks to him sitting next to me helping translate words so that I didn't confuse words like 'sitting' and 'listening'.I should note that learning languages comes easily to me. I am a native English speaker, fluent in Spanish, excelled at reading Latin for years, and also was at one point moderately capable in Italian after a year of instruction in college. Rosetta Stone Turkish left me frustrated and incapable of communicating with my future in-laws. Save your money!!!", "overall": "-"}
{"reviewText": "I purchased the online version of this product because I want to learn Turkish.  If you are serious about learning Turkish do not buy this. You will not learn any grammar at all and there is no English translation whatsoever.  There is a lot of vocabulary but I found it to be totally random and useless because I was unable to use it to carry on a conversation.  I was not able to take a single thing I learned from the program and actually use it in a daily conversation or any conversation for that matter.  I would not recommend this product to anyone.  It was a huge disappointment and waste of money to me.", "overall": "-"}
{"reviewText": "Having owned version 2 of Rosetta Stone Vietnamese, I was excited to try Rosetta Stone's new Version 4 TOTALe program.  Since they offered a trial or demo disk, I ordered a disk and tried it.  It seemed good and I liked all the improvements over version 2.  So I decided to buy the the program.  To Rosetta Stone's credit, this version is a giant step forward in interaction and variation of teaching methods to keep the Vietnamese student involved and interested.  The package includes a headphone & microphone set so you can speak the words you hear, and the computer will let you know if you're pronouncing the words and phrases correctly.  In fact, you can set the program's tolerance level of your pronounciation.  This new version also allows you to type in the words and phrases your hear, thereby helping you to learn how to spell the new language you are speaking.Unfortunately, in spite of all these new improvements, there were two problems (serious problems in my evaluation) that made me return the program for a refund.  The first problem was pronounciation.  Vietnamese is a tonal language; in fact, it has 6 different tones.  Also, there is a significant difference between the North Vietnamese dialect and the South Vietnamese dialect.  This program proportedly teaches the northern dialect, but the pronounciation is not correct.  In version 2, the pronounciation was textbook perfect; each tone was distinct and precise.  In version 4, they've gotten sloppy.  Specifically the high-rising tone used in some words (like con cho' [= dog], con ga'i [= girl], etc.) is pronounced  with a falling, rising tone (like pha?i [= yes] or ho?i [= question].  My wife, who is Vietnamese, confirmed these mispronounciations.The other problem is the method used to type in Vietnamese words.  When Vietnamese people type proper Vietnamese with tone marks, they usually use one of two methods: VIQR and VNI. (Look up these methods on the internet.)  But, Rosetta Stone doesn't use either of these common methods; instead have come up with their own method.  Unfortunately, it is very cumbersome and painfully slow.So, because of these 2 serious problems, I can't fully reccommend this program.  There are many other programs available that teach Vietnamese.  One I CAN recommend is called \"A Little Vietnamese\" by Griesser Software.  This program is unique in that it teaches both North and South Vietnamese dialects and the differences between them.  Unfortunately, it does not work on Macintosh computers, unless you have a Windows-simulator program (like Virtual PC or Parallels).  Rosetta Stone V4 will work on both Mac and Windows machines.", "overall": "-"}
{"reviewText": "I've been working on installing this thing now for SO LONG...it's so cumbersome.  It's not like modern software at all.I don't get it...even after giving it the license, it still churns FOREVER.  I don't know what it's doing...eating my pc alive?Why does it take so long to get to the training? I'll be dead of old age before i get there...", "overall": "-"}
{"reviewText": "Would be better if they were laminated or something. Anotherbig  CON for me is that these do not use the squares that come in most of the 'shape sets'..I don't understand why not..you might wana shop around for a set of these that incorporates all the shapes in the set.", "overall": "-"}
{"reviewText": "Very large and it looks pretty cheap.  It's also pretty difficult to see time in sunlight. It's unique, but it's not that great of a buy.", "overall": "-"}
{"reviewText": "This is a very short book that's great for an infant or very young toddler.  The pictures will catch the attention of your little one.  Naturally, they love that it makes sounds, but imagine my daughter's dismay when it stopped making the kissing sounds the day after she got it. And no, she's not one of those kids who sits there and incessantly pushes the buttons until the batteries run out immediately.  I got new batteries to replace it (takes 3 small calculator batteries), hoping it was just a problem with the batteries being old and replaced all three.  Guess what?  It worked for about 10 button presses and stopped again.  Since I had a large pack of the batteries, I did one more replacement when my daughter begged me to months later.  Same thing...a handful of button pushes and then nothing.  Now my daughter wants to throw the book in the trash.  I can hardly blame her.", "overall": "-"}
{"reviewText": "Sometimes, I think Lonely Planet has become so popular on the backpacking set that no one even questions its substance.When I was in Thailand, people referred to this as their &quot;Bible&quot;, an incredible overstatement.  It isn't that the information was wrong, just incomplete when it seemed to matter.I think there are other guidebooks that offer better information, even though budget travellers are made to believe it is the only series for them.  Shop around before you buy this.", "overall": "-"}
{"reviewText": "I agree with some of the other customer review that this &quot;guide&quot; is far from one of the best.  The information is sometimes wrong (unfortunately at the most inconvenient of times).  In addition the book is hardly a &quot;guide&quot;.  The walking tours, for example, give you little information and simply plop you at a site.  This is more of a handbook to accommpany a map.  The book seems to inspire the kind of tourism where one looks, but does not realy try to understand the culture around you. The worst part about this book is that it is not arranged well.  Each area you visit is arranged by &quot;activity&quot; like accommodation or food.  This is particularly annoying in the Bangkok section, where one has to constantly flip from section to section in order to figure out anything about where you are in the area of town you are visiting.  On the positive side, the recommendations of accomodation are decent.  Overall though, I recommend to get another guide.  Lonely planet has gone lazy.", "overall": "-"}
{"reviewText": "This item was supposed to be permanent press and was not.  It came out so wrinkled you couldn't even use it.I pressed it with my iron and it wrinkled badly when my husband tried to use it.  We threw the handkerchiefs away.", "overall": "-"}
{"reviewText": "this watch was kinda of broken when i got it and it didnt really work and i tried to return it and it didnt really work other then that i loved it", "overall": "-"}
{"reviewText": "it's like a square when you hold it up. nice material tho, and bright arresting color. just not for tall people.", "overall": "-"}
{"reviewText": "I sent this mess back! Looked good on the picture, but don't be fooled. It's small, the strap is thin and it's big enough to hold a wallet and some make up. Dude...seriously, if you're thinking about getting this for your laptop, you will be disappointed. There is no cushion or protection for your electronics. Just.....purse. Good customer service though. They refunded me promptly.", "overall": "-"}
{"reviewText": "Looks good on the outside but basically useless as bag can barely fit anything: so narrow if you're carrying anything but a one inch thick book, you're out of luck!!!", "overall": "-"}
{"reviewText": "was not a us 34  i am returning the pants the sizing is not correlated with us measurements  it may be onerous to return to germany  is there a us location?", "overall": "-"}
{"reviewText": "I've had it for a about 2 years...then just like the earlier reviews, the band just broke and came loose. It's not the band that needs replacement, it's the whole assembly where the band hooks up. I've asked some watch stores and it's gonna be costly to have it repaired. Just a sad end, to an otherwise very functional time piece.", "overall": "-"}
{"reviewText": "The Casio SPF-60 was a gift from my children.  It did an OK job of providing barometric data and altitude and depth.  However, the casing was not well made. The band separated from the casing one day while I was eating dinner.  The store at which it was purchased sent it to Casio on our behalf.  Casio called to advise that the watch arrived at their facility more than a year after purchase and therefore was not covered by the warranty.  They offered to replace the casing that had failed for a charge of $67.00.  A lot to pay for a watch that a company will not stand behind.Casio was technically correct. If you do not expect more than a year from a $200 watch, then this is a fun time peice.  If you want something that will last more than a year, I recommend you look to another manufacturer.", "overall": "-"}
{"reviewText": "After using my Sea Pathfinder Casio for about 1.5 years the band just broke without any special cause.  After taking it apart, it appears that the actual case broke and not the band.  It is impossible to simply replace the band.  I would need a new section of the case to replace the plastic piece that broke.  A disappointing end to a watch that otherwise performed well.  Apparently this is a reoccuring failure mode for this watch and one for which potential buyers should be aware.", "overall": "-"}
{"reviewText": "I enjoyed the features inclduing altitude, temperature and barometer.  Worked fine for over one year.  The problem I had is that the housing around the bezel broke.  I thought it was the band and ordered a replacement.  Took it in to a watch repair store and they said this was not the first one they saw that the housing broke away.Too bad the quality did not match the features.", "overall": "-"}
{"reviewText": "Anyone who rates this high just hasn't had the band break yet.  I had mine since May 2005 and it is an awesome watch.  I couldn't have wanted more.  I took it everywhere.  While walking down a hall at work the band separated from the watch housing.  End of watch.  Repair estimate was $60 plus shipping, etc.  Only a 90 day warranty on the new band.", "overall": "-"}
{"reviewText": "I bought this model last month; was excited about the \"triple sensor\" features. It is a let down! It's basically good for just telling time.The compass settings were off; had to be recalibrated manually.The barometer readings don't help much in predicting the weather... The manual go back and forth on its usefulness.The altimeter readings are useless; they have to be recalibrated every time you change altitudes significantly.The thermometer is accurate -- but only if aren't wearing the watch for 30 minutes!The countdown timer goes up only to 60 minutes.The backlight doesn't have the \"stay on\" feature that Timex indiglo watches have. So, when you are trying to make settings to the watch in the dark, you are constantly interrupted by the fact the the light goes off after 2.5 seconds. Timex watches are smart enough to keep the light on if you are pressing other buttons.", "overall": "-"}
{"reviewText": "Product appeared to be in excellent condition, but when I couldn't get one shoe on that was the problem, It was a completely different size. Don't think I will be using that site again. The cost of return was almost $10 for a product that was misrepresented!", "overall": "-"}
{"reviewText": "Sizing on all Top Gear apparel is at least two sizes too small.  This comes from the UK I guess were the sizing is apparently very different than America. Plus they shrink incredibly in the dryer.  XXL is too small for a 6 foot 190 pound man.  Beware!  I ordered two different shirts and ended up using them as rags.", "overall": "-"}
{"reviewText": "I ordered an XL for my hubby, he is not huge but is tall.  This XL looks like a child's XL, it would be short on me.", "overall": "-"}
{"reviewText": "SO I WANTED THIS FOR A CONCERT THAT WAS 5TH OF JUNE AND I HAVENT GOT IT UNTIL NOW !!!!!!I ORDERED IT ON 22nd MAY, THATS LIKE 2 WEEKS EARLIER !!! R U KIDDING ME !!!!", "overall": "-"}
{"reviewText": "The Hat was okay simply because it was sized properly for an adult, wasnt impressed with knitting as it looks like will unravel with slightest snag.", "overall": "-"}
{"reviewText": "The watch was nice but, when I  took it to a jeweler to remove links, there was a problem.It should have taken 3 min. to remove links and they worked on it for more than 30min. and still couldn't remove enough links to make it fit as I wanted. Jeweler said it was as though pins were too large and I should return to wherever I bought it!", "overall": "-"}
{"reviewText": "The picture is deceptive.  The chain and stone are cheap looking. Fake sterling silver. Stone is not at all like the image. Very dull. Plain. Way too high a price for such a piece of jewelry. Don't bother w/ this piece.", "overall": "-"}
{"reviewText": "I like it but I think it's overrpiced. A bit smaller than I expected too. A total waste of my money.", "overall": "-"}
{"reviewText": "This is poor fake product, he sold it as original and charge it at almost normal pricing, the pieces are falling off it after 5 office uses, the bracelet's pins are split in half. Bad product! Bad fake!", "overall": "-"}
{"reviewText": "The product looks beautiful in the picture but I was very disappointed after receiving it.  Not in good condition.  It was a shame because it was for a birthday gift.  Love shopping Amazon though.  Found so many great things for gifts.", "overall": "-"}
{"reviewText": "Supposed to look like Disney's dwarfs, huh? And what's with that Mickey head? How did they get that past Disney merchandising standards? Are they paying Disney their share for the Mickey head? I doubt it. Unlicensed Disney merchandise is a no-no.  And Dopey does not have a beard.", "overall": "-"}
{"reviewText": "I was disappointed with this bracelet. The stitching on the tab part is sloppy. Looks cheap. I would not recommend this product.", "overall": "-"}
{"reviewText": "THIS WAS JUST A STRIP OF LEATHER!  PICTURE WRAPPING A LEATHER LACE AROUND YOUR ARM. I WAS COMPLETELY DISSATISFIED AND ENDED UP THROWING IT AWAY.", "overall": "-"}
{"reviewText": "The sponge bob I got I'm not happy I want a new smaller sponge bob I'm not happy at all", "overall": "-"}
{"reviewText": "Bracelet is not completed. (ends are not connected) If it would be connected it would not fit an adult it would be a small child.", "overall": "-"}
{"reviewText": "Received it quick but had to find a way to put it on baby. It lasted a couple of weeks and then it broke. I don't even know where it ended up.", "overall": "-"}
{"reviewText": "The card slots are nothing more than cuts in a thin piece of leather with a piece of fabric glued in. When trying to put a card in, the edge of one of the slits tore completely in two and another is well on its way. The adhesive didn't hold so the fabric came out with the card so now there's a sticky residue and the cards slide down so far they're all bunched behind the bottom slot. I ordered two and the same thing happened when my Mom tried using hers. We weren't at all rough with them, they're just that poorly made. I will definitely never purchase from this seller again if this is the type quality that can be expected.", "overall": "-"}
{"reviewText": "Because as you should know i ve neer got it!.You lost it in Transit.It was a realyy proble x me.Diego Echandi", "overall": "-"}
{"reviewText": "The sizes were off! I ordered a size 6 they  sent  a size 3 ! needlessly to say.the young girl was most unhappy so was I!But I felt that it was not worth returning it all the way back to Korea!.", "overall": "-"}
{"reviewText": "These shoes are extremely pretty. Not pink like pictured, more salmon colored, but looking great. They are not light, they are made of good rubber material. BUT here is the problem, the edges of the straps are so sharp that it's impossible to wear. They will give you nasty cuts. I only wore them around the house today and I have cuts on my toes. Such a shame because they are so pretty and they're made out of such great quality rubber. Wish they would make the edges in a different way.", "overall": "-"}
{"reviewText": "Not very comfortable at all, at least better than bare foot in the skele-toes shoes.However, these overpriced socks only lasted 2 days. A hole on the side was torn on the third time I tried to put them on where it is a pain to do so to begin with anyway.", "overall": "-"}
{"reviewText": "I ordered these for my son's birthday. They say they are adult's size 6-12 but they wouldn't fit a child.", "overall": "-"}
{"reviewText": "When a blessed item is sold, the blessing is lost.  Therefore, if someone were to sell an item that was blessed by the pope, for example, the blessing would be lost.  The person who purchases the item would not have an item blessed by the pope as the blessing would be lost.  Blessings can never be sold.  Even if the seller explicitely states that the blessing is not being sold, it is still lost.  The blessing cannot be passed on if the item is sold, traded, or bartered.  To imply that the blessing continues after the sale is simony and fraud.  You cannot ever buy, trade for, or barter for a blessed item and still retain the blessing.", "overall": "-"}
{"reviewText": "I just recieve my leopard mini clubbing dress today..and im not very happy with it ! The style and the fabric that I order is not even look the same like in the picture...im so very frustrated :(", "overall": "-"}
{"reviewText": "it was not how i expected it to be i am dissapointed i expected it to be lower from the back but it was like a shirt", "overall": "-"}
{"reviewText": "I was thinking i was buying a legit hat..instead i was sent a fake one, i was not happy with my product i recieved.", "overall": "-"}
{"reviewText": "MY SWAG METER IS OFF THE CHARTS NOW. I NOW HAVE SO MUCH SWAG THAT ALL MY FRIENDS WANNA BE LIKE ME YO", "overall": "-"}
{"reviewText": "Great idea,but they haven't perfected itThe tail piece loses it's spring back shape,which keeps the thing stayed putThe front edge is also curved outward when it should be curved inward to lay flat against the bodySOLUTION  :  I put it in a steamer basket with the water boiling below it and after a few min.Your able to re-bend the tail piece tightly into the C shape as well as put a slight inward bend to the front top edgeJust wish the C Thong would hold its shapeWhen they find something with more spring back for the frame it will fit much better and not start falling off after an hr or so", "overall": "-"}
{"reviewText": "When I finally received the item it either bent from shipping or bent from just being poor quality. It is very uncomfortable. The fabric is like almost like swimsuit material, very weird. It doesn't stay in place. Can't see wearing this for more than 2 minutes. Don't waste your money... this product is pointless.", "overall": "-"}
{"reviewText": "I tried it, thought it would be neat, but think it through, every time you have to do anything in the bathroom, you have to take it completely off and hold it in your hand or put in on the counter.  That and I also think the wire is to bulky, I feel like everyone else can see the outline under my clothes.", "overall": "-"}
{"reviewText": "My wife liked the concept but not the color, she feels it looks like she is wearing a feminie napkin, we bought black and it looks better.", "overall": "-"}
{"reviewText": "I am not satisfied with the C string that I received.  I think it would be ok if the plastic was not twisted.  They shipped it in an envelope too small and therefore distorted the plastic.  I cannot wear it because of the twisted plastic, it's distorted and sticks out farther on one side.Maybe I didn't order from a reputable seller, I don't know.  I think I will go into the *** store here and purchase one.THREW IT AWAY.", "overall": "-"}
{"reviewText": "Not what i excpeted. Very cute n all but very  uncomfortable , irritating.if it was made out of different material.and i do have a big buttox and it wasnt fitting right.", "overall": "-"}
{"reviewText": "My wife is a small frame but she has a bit of a pooch and it wouldn't pinch very well and wants to pop off if you're not wearing something over it.  It also rubs in the back at the top of the crack so she never wears it.", "overall": "-"}
{"reviewText": "The bone is too big. It protrudes under clothing which defeats the purpose of using it in place of traditional thongs. If I knew it was like this, I would not have bought them.", "overall": "-"}
{"reviewText": "I bought this because it seemed like a good idea at the time unfortunately the end got stuck up my butt and im now waddling maybe I should go to the e.r?", "overall": "-"}
{"reviewText": "I usually love when my husband buys me lingerie but this was so tiny I have no idea what he was thinking but it is still sitting in the packaging it came in.", "overall": "-"}
{"reviewText": "This product did not work well for me...maybe because I am very slender.  I gave it to my Full-Figured sister. Would not recommend this product.", "overall": "-"}
{"reviewText": "Let me start by saying that I am a man and, as such, the contents of my undergarments are different than those for whom this product was designed. Sadly, I did not discover this until after purchasing and trying the C-String.My wife and I were celebrating our 5th anniversary and I wanted to do something special to surprise her after dinner. I figured that we would have plenty of time that evening as my custom is to spend $1 per year that we've been together on each of our meals and that price point doesn't lend itself to multiple courses.I quickly discovered the C-String while doing alphabetical research on \"exciting underwear\" and I immediately ordered one. Between its exciting novelty and presumed ease of removal (more on this later), I was sure that my wife would feel like the luckiest girl in the world and that this would translate to an exciting evening.3-5 business days later, on our anniversary, I received a discrete brown box with a smile on the outside and giddily ran it upstairs to the bathroom where I could lock the door and be alone. Immediately, I wished that I had brought my computer with me as the product came without instructions and \"installation\" was not turning out to be intuitive. Without an online resource to guide me, I was forced to experiment.As it happens, and completely by accident, my first attempt ended up being correct (in terms of orientation), but I didn't realize it because of the awkward result that the C-String had in parting the company of certain anatomical neighbors for which distance is a source of pain. Plus, the C-String kept slipping down in a way that, from the back, probably resembled a video tape being ejected from a VCR.I tried reversing the garment. This solved the problem of parted anatomy in the front, but created a similar (and similarly painful) issue in the back. I found that squatting and bending forward alleviated some of the pain, but decided that maintaining this position for the entirety of our anniversary celebration, might clue my wife into the the surprise that lay in store for her, thus threatening the full force of its impact and the excitement that would be derived therefrom.Next, I tried wearing donning the C-String in a horizontal, rather than vertical configuration - with the band going around my hip. Initially, I found no discomfort, but as I stood there admiring my ingenuity in the mirror, I realized that something wasn't right. Imagine a pirate with his eyepatch covering his ear instead of his eye and you'll have a pretty good idea of what was going wrong for me.Again, my thoughts wandered to my computer but I could hear movement outside the door and knew that unless I wanted to risk discovery, I was on my own. I studied the C-String intently for a while and decided that the skinny end must go in back. The pain, I decided, I could handle, but how could I prevent it from slipping down? Then it hit me: Maybe the skinny bit at the back wasn't supposed to remain external (if you know what I mean).What happened next is something that I won't share, but it involved deep questions about my level of love and commitment to my wife, a small container of Vaseline, some blood, and some tears. I decided to hide the C-String and come back to it after I had found a computer and an ice pack.Sadly, I did not have time to consult my computer or experiment any further before the time came to depart for the restaurant. Not wanting to waste the C-String, I adjusted the frame ever-so-slightly and told my wife that it was a Google Glass that I was going to use to record our date. Happily, she believed me and was thrilled at the idea. Sadly, she shared my plans with the woman who took our order at the restaurant and we were immediately asked to leave.On the plus side, I didn't have to explain why I didn't have any video of our evening. 2 Stars.", "overall": "-"}
{"reviewText": "It comes and a little package and my wife opened but it comes like sideways, she tryn to weared and breakes", "overall": "-"}
{"reviewText": "I am very unhappy with the dealer . As i order this product in the month of december and still after 6 months i didnt get this product. I have contacted 2 times with the dealer and they ensured me to send it again in the month of feb . But still i m not getting this product . I strongly recommended not to buy this product from this dealer as its a waste of money .", "overall": "-"}
{"reviewText": "I chose these because the price was so good.  I should have paid a little more attention...they are shorter than extenders I've previously purchased (requiring use of two of them on one bra) and I didn't notice the hooks and eyes are not colored to match.  Left me wishing I'd paid a little more to get better quality.  Considering all this, they're appropriately priced.", "overall": "-"}
{"reviewText": "Looks much cheaper in person than on line. The fabric is what does it. Stitching is good but just cheap design.", "overall": "-"}
{"reviewText": "I was very taken aback by this product. First of all, it looked quite unflattering on me. The product description said, &#34;One size fits most,&#34; but no one ever told me it was made just for women. Secondly, I was surprised that when I put it on, I could still see my nipples. I didn't realize this of course until I was half way to the McDonalds in my matching g-string and lace gloves, when someone in a moving car yelled something about my nipples being the size of dinner plates. I had naturally assumed by the advertisement photo that this would somehow be covered up, but no! there were my big, pink chesticles for all to see. Sufficed to say, sitting in the McDonalds and devouring my five super sized Big Macs, I felt quite embarrassed.", "overall": "-"}
{"reviewText": "It looks nice and all but it don't fit. I understand I put on a few pounds but this shirt should have fit and it doesn't and in no way is that my problem", "overall": "-"}
{"reviewText": "Unfortunately I did not get a ring. I sent some book, which do not need. the money is returned back, But I'm not satisfied with.", "overall": "-"}
{"reviewText": "I was duped by that picture. The material is cheap. The look is cheap. The packaging is nice. Don't buy that dress. If u want that dress take a scrap cloth and cut it up. I may look better than that dress. I will never wear it. Its really really really low class. It also takes forever to reach. Poor poor poor service. Poor", "overall": "-"}
{"reviewText": "These were terrible.  Broke the first day wearing them.  I guess you get what you pay for. Would not recomment.", "overall": "-"}
{"reviewText": "The black knitted hat was not what I ordered.  I thought I was getting a childs small .  It was returned", "overall": "-"}
{"reviewText": "Both hats purchased are starting to come apart between the eyes after less than a month. Both have only been worn 3 or 4 times. Contacted Amazon and was told the vendor would be contacted. Well, it's over a week now and still have not heard anything. Guess I'm stuck with this junk.", "overall": "-"}
{"reviewText": "The look of the ear muffs from the picture fine. The fit is not. They are too small to wrap around the head and then they aren't snug.", "overall": "-"}
{"reviewText": "They can't fit any human being's head. These ear muffs are probably made for a kitty or a goldfish. So small and uncomfortable.", "overall": "-"}
{"reviewText": "Very disappointed in the quality for the price. Cheaply made. Face mask and shin guards made out of brittle plastic.", "overall": "-"}
{"reviewText": "Okay, this is flimsy material. The velcro tail detaches itself easily and the whole costume folds up as the material naturally curls. It's a nice one off costume but nothing more.", "overall": "-"}
{"reviewText": "Material is too thin, would be good for a warmer climate. My baby wears size 12 months but this barely fits him. Have to return it.", "overall": "-"}
