10
100
12
15
20
200
30
34
40
45
4t
90
ability
able
absolutely
access
accident
accommodate
account
activation
actually
add
addition
adorable
adult
adults
advantage
affordable
afraid
age
ages
ago
allow
allows
almost
along
alphabet
already
also
although
always
amazing
amazon
amount
another
answer
anyone
anything
anyway
anywhere
apart
apparently
appears
application
approach
apps
arabic
around
arrive
arrived
asked
aspect
assumed
attempt
attention
attractive
audio
available
average
avoid
aware
away
awesome
baby
back
bad
bag
ball
ballerina
ballet
band
based
basic
basically
bathroom
beat
beautiful
become
bed
begin
beginning
behind
believe
best
better
bible
big
birthday
bit
black
blue
boo
book
books
bother
bottom
bought
box
boxes
boy
bracelet
brand
bright
bring
broke
broken
brought
brown
bucks
business
button
buttons
buy
buying
ca
call
called
came
car
cardboard
care
carry
case
cd
certain
change
charge
cheap
cheaper
cheaply
check
child
children
chinese
choice
christmas
class
classes
clean
clear
click
close
cloth
clothes
code
collection
color
colored
colors
come
comes
comfortable
common
company
compartments
complaint
complete
completely
computer
computers
con
concept
condition
confused
considering
constantly
constructed
construction
contact
contacted
content
context
conversation
copy
correct
correctly
cost
costs
costume
could
couple
course
covered
culture
customer
customers
cut
cute
cycle
daily
dance
dancing
date
daughter
daughters
day
days
deal
decent
decided
definitely
delivery
depending
described
description
design
designed
detail
dictionary
didnt
different
difficult
dinner
directly
disappointed
disappointing
disappointment
disk
doesnt
done
doubt
draw
drawers
dress
dressing
dressup
due
durable
ear
earlier
earrings
ears
easier
easily
easy
eating
edge
edges
either
elastic
elegant
else
elsewhere
email
end
ended
ends
english
enjoy
enjoyed
enough
entire
error
errors
especially
etc
even
evening
ever
every
everyday
everyone
everything
everywhere
exactly
example
excellent
excited
expect
expected
expecting
expensive
experience
explain
explanation
explanations
extra
extremely
eyes
fabric
face
fact
failed
fair
fairly
fairy
fake
fall
falling
family
fantastic
far
fast
fault
favorite
feature
features
feel
feels
fell
felt
feminine
figure
finally
find
fine
finished
first
fit
fits
five
flat
flimsy
fluent
fluffy
follow
foot
force
foreign
formal
found
four
frame
free
french
friend
friends
front
frustrated
frustrating
full
fuller
fun
future
gave
gender
german
get
gets
getting
gift
gifts
girl
girls
give
given
gives
giving
glad
glued
go
goes
going
gone
good
got
grammar
grand
granddaughter
granddaughters
great
green
ground
grow
growing
grows
guarantee
guess
guide
half
halloween
hand
handle
happened
happens
happier
happy
hard
hardly
head
hear
heavy
held
hello
help
helpful
helps
high
higher
highly
hit
hold
holding
holds
hope
hoping
hour
hours
house
however
huge
human
husband
idea
im
image
imagine
immediately
immersion
important
impossible
impressed
impression
inch
included
information
insert
inside
install
installs
instead
instruction
instructions
interact
interested
interface
internet
intuitive
involved
issue
italian
item
jacket
japanese
jewelry
jewels
job
joke
keep
keeps
kept
key
kid
kids
kind
knew
know
knowing
korea
korean
lady
language
languages
laptop
large
larger
last
lasted
later
lay
layers
learn
learned
learner
learners
learning
least
leather
left
leggings
length
less
lesson
lessons
let
letters
level
levels
life
light
like
liked
likely
likes
limited
line
listening
literally
little
live
living
ll
load
local
lock
lol
long
longer
look
looked
looking
looks
loose
lost
lot
lots
love
loved
loves
low
lower
mac
machine
made
make
makes
making
man
many
marketing
match
matching
material
materials
matter
may
maybe
mean
means
meant
method
microphone
might
mind
minute
minutes
mirror
miss
modern
money
month
months
mother
much
multiple
must
na
native
naturally
nearly
neat
necklaces
need
needed
needs
neice
never
new
next
nice
nicely
niece
night
none
normal
note
nothing
nt
number
observation
obviously
offer
offered
often
ok
okay
old
older
one
onerous
ones
online
open
opened
opening
options
order
ordered
ordering
organization
organize
os
others
outfit
outside
overall
overpriced
package
packaged
packaging
paid
pain
pair
pants
part
particular
parts
party
pattern
pay
paying
pc
people
per
perfect
perfectly
permanent
person
photo
phrase
phrases
pick
picture
pictured
pictures
piece
pieces
pimsleur
pink
pins
place
plain
plan
plane
plastic
play
playing
pleasantly
please
pleased
plenty
plural
plus
point
poofy
poor
poorly
possible
practical
practice
present
pretty
price
priced
princess
probably
problem
problems
process
product
products
program
programs
promptly
pronounce
pronouncing
pronunciation
properly
protection
provide
provides
puffy
pull
pulling
purchase
purchased
purchasing
purple
purpose
put
puzzle
puzzles
quality
question
questions
quick
quickly
quite
random
rate
rather
rating
re
read
reading
real
realize
really
reason
reasonable
receive
received
receiving
recieved
recital
recognition
recognize
recommend
red
refund
refunded
refuses
regular
remember
removable
remove
repair
repeating
replace
replacement
require
required
research
response
rest
result
return
returned
returning
review
reviews
right
ring
ripped
room
rosetta
rossetta
rough
rs
rules
run
russian
said
satin
satisfied
saw
say
saying
says
school
screen
second
seconds
section
secure
see
seem
seemed
seems
sell
seller
send
sense
sent
sentence
sentences
separate
separated
serious
seriously
service
sessions
set
settings
several
sew
sewed
sewn
shame
shape
shining
ship
shipped
shipping
shirt
shopping
short
shorter
shorts
show
showing
shown
side
similar
simple
simply
since
single
sister
site
sites
sits
sitting
size
sized
sizes
skirt
skirts
slide
slightly
slots
small
smaller
smell
soccer
soft
software
sold
someone
something
sometimes
son
soon
sort
sound
sounds
space
spaces
spacious
spanish
speak
speaker
speakers
speaking
special
specific
specifically
speech
spend
spent
spoke
stand
standard
star
stars
start
started
starting
stated
stay
stick
still
stitching
stone
stood
storage
store
stores
straight
stretched
stretches
stretchy
structure
stuck
student
studied
study
stuff
sturdy
style
subscription
success
suggest
suitable
super
support
supposed
sure
surprise
surprised
system
table
take
taken
takes
taking
tall
teach
teacher
teaches
teaching
tech
tell
thank
thanks
theory
therefore
thick
thin
thing
things
think
thinking
though
thought
three
thrilled
throw
tight
time
times
tiny
today
toddler
together
told
tons
took
tool
top
total
totally
touch
toy
translate
travel
traveling
trial
tried
trip
true
try
trying
tulle
turkish
tutor
tutu
tutus
twice
twirling
twisted
two
type
unable
uncomfortable
underneath
understand
unfortunately
unique
unless
upgrade
upon
upset
us
use
useable
used
useful
useless
user
users
uses
using
usually
value
ve
verbs
version
via
vibrant
visit
visual
vocabulary
voice
waist
waistband
wait
want
wanted
wants
wash
washed
waste
watch
water
way
ways
wear
wearing
wears
week
weeks
weird
well
went
white
whole
wife
winter
wish
within
without
wo
woman
wonderful
word
words
wore
work
worked
working
works
world
worn
worried
worry
worst
worth
would
write
writing
wrong
xmas
year
years
yellow
yes
yet
young
younger
yr
